<!DOCTYPE html>
<html>
<head>
	<title>Предисловие</title>
	<link rel = "icon" href = "../img/unv.png">
	<link rel = "stylesheet" href = "../style/style_lit.css">
	<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
	<link rel="preconnect" href="https://fonts.googleapis.com">
	<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
	<link href="https://fonts.googleapis.com/css2?family=Montserrat+Alternates:wght@200;300&amp;display=swap" rel="stylesheet">
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<style>
		body{
			background-image: url(./fone/0.jpg);
		}
		hr{
		    color: #00FFFF;
		}
		.content-main{
		    background-color: rgba(0,0,0,0.6);
		}
	</style>
</head>
<body>
	<div class="content-main">
		<div class="container">
			<div class="row">
				<div class="col-12">
					<div class="header">
						<h3 style="text-align: center; color: purple; font-family: serif;">Вселенская война. Предисловие.</h3>
					</div>
					<p>Автор: DarkusFoxis.<br>Герои: Восьмой, Оригинал.<br>Возрастное ограничение: 6+.</p><hr>
					<p>Обрыв в горах. На краю его стоит парень лет 15-17, а позади него, сжав руку в кулак, стоит похожий, но у него уши лисы и два хвоста. Погода в тот момент была весьма ветреной, но их это ничуть не смущало. Стояла гробовая тишина. Наконец, парень с хвостами решил нарушить спокойствие:</p>
					<p>– Ну так, что случилось? – спросил он.</p>
					<p>– Я предвижу, что наши действия заводят в тупик остальные миры. – ответил другой, даже не обернувшись на ушастого. – Всё вывалилось из рук, что сильно усугубило ситуацию в команде, а это плохо сказывается и на обычных людей, и я хочу посоветоваться с тобой, мой дорогой Восьмой.</p>
					<p>– Я готов тебя выслушать. – ответил Восьмой, задрав уши к небу. – Постараюсь сделать всё, что в моих силах.</p>
					<p>– Хорошо, – ответил стоявший у края, повернувшись к лису, – тогда ответь: что мне сделать? Устроить Армагеддон, или же сбросить наш мир во время до появления моих способностей?</p>
					<p>– Что?! – у Восьмого хвосты встали дыбом. – А… Нет ли другого вых…</p>
					<p>– Нет. Есть лишь два варианта. – Правый глаз человека загорелся голубым огоньком, и в нём было отчётливо видно то, что он дальше описывал словами. – Я предвижу наш будущий проигрыш и последующее восстание. Такими темпами, умрут не только наши помощники, но и мы. Даже я, самый сильный из нашего отряда, умру, и тогда отряд захватчиков начнёт войну среди таких же захватчиков. Всё это приведёт к такому катаклизму, что даже мой Армагеддон, по сравнению с ним, будет ничем. Всё живое и неживое будет изничтожено до атомов. Немногие выжившие будут пребывать в неимоверно адских условиях. – Глаз перестал гореть синим пламенем, вновь став серо-голубым. – Так что я жду твоего совета.</p>
					<p>– Ты же знаешь… Я с ней… – опустил голову Восьмой.</p>
					<p>– Я понимаю, каких тебе трудов доставит воссоединение с ней, но это вынужденные меры. Ну так что?</p>
					<p>– Сброс. Давай вернёмся назад и попробуем исправить…</p>
					<p>– Я понимаю тебя и твоё положение. Но, ты уверен?</p>
					<p>– Н-н-н-н-н-нет…</p>
					<p>– Хорошо.</p>
					<p>Паренёк подошёл к восьмому, поднял руку, в которой был непонятный прибор с сапфиром посередине, и приложил к нему лапу восьмого с когтями, в которых находился изумруд.</p>
					<p>– Ну, готов?</p>
					<p>– Да. Только пообещай мне, что заберёшь меня пораньше.</p>
					<p>– Хех, если не забуду.</p>
					<p>Из глаз Восьмого вспыхнуло фиолетовое пламя, а из правого глаза его товарища, вставшего рядом с ним, вновь выбилось голубое. Словно вылетев из глаз, эти огоньки быстро окружили двоих, превратившись в самый настоящий пожар, и через несколько мгновений над ними образовалась чёрная, начавшая крайне стремительно разрастаться, дыра, что почти тут же погрузила стоявших на горе в кромешную тьму…</p><hr>
					<a href="1" class="link">Следующая глава →</a><br>
					<a href="../univers" class="link">Вернуться к списку рассказов.</a>
				</div>
			</div>
		</div>
	</div>
	<?php include '../template/footer.html'; ?>
</body>
</html>