<!DOCTYPE html>
<html>
<head>
	<title>Глава 1</title>
	<link rel = "icon" href = "../img/unv.png">
	<link rel = "stylesheet" href = "../style/style_lit.css">
	<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
	<link rel="preconnect" href="https://fonts.googleapis.com">
	<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
	<link href="https://fonts.googleapis.com/css2?family=Montserrat+Alternates:wght@200;300&amp;display=swap" rel="stylesheet">
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<style>
		body{
			background-image: url(./fone/1.jpg);
		}
		hr{
		    color: #00FFFF;
		}
		.content-main{
		    background-color: rgba(0,0,0,0.65);
		}
	</style>
</head>
<body>
	<div class="content-main">
		<div class="container">
			<div class="row">
				<div class="col-12">
					<div class="header">
						<h3 style="text-align: center; color: #FF00FF; font-family: serif;">Вселенская война. Глава 1. Миссия: «Сундук с бесконечной энергией»</h3>
					</div>
					<p>Автор: DarkusFoxis.<br>Герои: Восьмой, Оригинал, Решительный, Статист.<br>Возрастное ограничение: 6+.</p><hr>
					<center><p>(Измерение 1 — «Обычный мир»: Наша родная вселенная, к которой мы так привыкли.)</p></center>
					<p>Город К*. Весна, месяц май. Последние ручейки растаявшего снега текут к городской реке. Комната четвероклассника.</p>
					<p>– …Ух ты, впервые за всё время такой отчётливый сон! Эх, жалко, я не смогу узнать, чем же всё закончилось…</p>
					<p>Ах да, его зовут И**.</p>
					<p>– Так… пора бежать в школу! – сказал И**, с кровати побежав одеваться. Рюкзак, благо, был собран ещё вчера.</p>
					<p>Погода на улице была прекрасной. Птички на деревьях пели о том, как прекрасно жить на свете, первые цветы начинали испускать свой первый запах, а ручейки весело журчали, говоря о том, что лето уже скоро — осталось поднажать совсем немного! Скоро наш герой прибыл в школу. В ней ничего особенного не было, всё как обычно: уроки, столовая, игры, общение с друзьями. Единственное только — всем четвероклассникам сообщили дату проведения экзамена, по итогам которого их будут принимать в пятый класс. Наш герой был к нему готов на все сто, но даже так, волнению в его сердце место нашлось. Экзамен был очень важным для него, ведь именно он решал его дальнейшее будущее, его дальнейшее обучение. Как бы то ни было, скоро уроки закончились, и все ребята разошлись по домам. Придя домой, И** начал делать уроки, а после сел читать свою любимую книгу, «Живую шляпу». Уже не знаю, который раз он её перечитывает, но факт того, что он всё ещё перечитывает эту книгу — просто убивает. Скоро наступил вечер, наш герой поел, и лёг спать.</p>
					<p>Именно так проходит его обычный день. Довольно-таки скучно, согласитесь. Но жизнь его неимоверно изменилась после экзамена. Звучит логично, но не в том смысле. В общем — продолжаем.</p>
					<p>После того самого экзамена, наш герой отправился в сторону центральной площади, где он частенько любил проводить свободное время. К тому моменту уже во всю светило солнце, трава была на пике своей густоты, цветов было огромное изобилие. Вот он, конец мая — совсем скоро любимое, жаркое, красивое и, к сожалению, быстрое, лето, любимое и детьми, и взрослыми. Птицы распевали свои песни, и слушать их, казалось, было лучшим занятием на свете, ведь невозможно украсть или испортить эту симфонию. Это симфония самой природы.</p>
					<p>Но, в один момент, наш герой заметил рядом с ним коробку, которая напоминала сундук, на которой сделана надпись: «Для И**».</p>
					<p>– Для меня? От кого? – сказал он, быстро осмотревшись. Не найдя никого, он подошёл к сундучку, и, немного поколебавшись, осторожно открыл его. Внутри лежали красивые камушки, хотя камушками их не назовёшь, ведь, они были прозрачными, и так отсвечивали на солнце, что глазам было больно.</p>
					<p>– Это шутка? Зачем мне эти стекляшки? – сказал И**, и взял самый большой, зелёный кристаллик.</p>
					<p>И этот кристаллик, на вид безобидный, вдруг начал ярко сиять, а над нашим героем появились тучи.</p>
					<p>– Что?! Тучи посреди ясного не... – Не успел он договорить, как тут же в него ударила молния. Везунчик, что тут сказать?</p>
					<p>Очнулся наш И** у себя дома. Изменения были на лицо: глаза из зелёных стали серо-голубыми, голос стал ниже по тембру, а волосы из светлых стали чуть ли не чёрными. В общем, наш герой преобразился.</p>
					<p style="color:#DAA520;">(Новый персонаж: Оригинал.)</p>
					<p style="color:#DAA520;">(Оригинал — глава команды. Его не обделили силой, защитой и умом, но обделили жизнями. Его показатель здоровья в всего 1 единицу никого не напугает, но стоит его разозлить… Лучше вам его не злить.</p>
					<p style="color:#DAA520;">Характер: Нейтральный, реалист, не очень любит новые знакомства.</p>
					<p style="color:#DAA520;">Рост: 180 см.</p>
					<p style="color:#DAA520;">Тотемный зверь: Дракон молний.)</p>
					<p>– А, где я? Ай, голова… Что это за стекляшки, которые ещё в придачу бьют током? А? А это что...</p>
					<p>Он глянул на руку, на которой находился непонятный прибор с сапфиром посередине. Этот камушек начал излучать какой-то свет. Непонятно, то ли у нашего героя проблемы с башкой, то ли это были не совсем стекляшки, но факт есть факт — сапфир стал излучать свет. Он был голубоватого цвета, и было совершенно неясно, с какого перепугу он начал светиться. Но очень скоро он стал светиться сильнее.</p>
					<p>– Ч... Что происхо...– не успел наш герой договорить, как тут же его куда-то перенесло.</p>
					<center><p>(Измерение 2 — «Кладбище сомнений»: Измерение, где никто не знает таких понятий как: Страх, неуверенность фобия и тому подобные.)</p></center>
					<p>Где же наш герой может появиться? В деревне? Банально. Посередине огромного города? Было. В открытом поле? Не-е-е. На вулкане — самое то.</p>
					<p>– Чего?!– Он явно был в шоке от таких появлений. – Почему именно ту... АААААА!!! – Вулкан неожиданно начал извергаться, а Оригинал полетел в сторону огромной крепости.</p>
					<p>– ПОЧЕМУ ВПЕРЕДИ МЕНЯ СТОИТ СТ...</p>
					<p>Бам! Лицом в кирпичную стену! Похоже, одним переломанным носом наш герой точно не отделается. И, естественно, классика жанра — наш герой, вспахивая носом кирпичную стену, съехал вниз. А внизу его ждал...</p>
					<p>– Оригинал, наконец ты... Пхххх, опять решил стену вскопать, да? – незнакомый парень подошёл к Оригиналу, и, похоже, использовал на него что-то вроде заклинания лечения, раз через несколько секунд наш герой поднял голову, смотря на незнакомца.</p>
					<p>– А... А кто ты?...</p>
					<p>– Ууууу, хех, ясно всё с тобой.</p>
					<p>Незнакомец достал из кармана свой кристалл, и преподнёс его к сапфиру Оригинала. Тот засиял ярче некуда. Через секунду свечение прекратилось, Оригинал поднялся на ноги.</p>
					<p>– Что это было... Стоп, ты... – Немного в шоке был Оригинал.</p>
					<p>Незнакомец ехидно заулыбался. – И кто я?</p>
					<p>– Решительный... Я правильно понял?..</p>
					<p>– Да, вспомнил.</p>
					<p style="color:#DAA520;">(Новый персонаж: Решительный.)</p>
					<p style="color:#DAA520;">(Решительный — лучший стрелок команды и напарник Оригинала. Его речь чуть быстрее обычного, что делает необычным его, а нестирающаяся улыбка с лица только дополняет его образ как маньяка, коим он не являлся.</p>
					<p style="color:#DAA520;">Характер: Агрессор, оптимист, не может жить без движухи. Главный затейщик многих драк и/или праздников</p>
					<p style="color:#DAA520;">Рост: 175 см.</p>
					<p style="color:#DAA520;">Тотемный зверь: неизвестен.)</p>
					<p>– Ну, опять сбрасывал, да? – спросил Решительный.</p>
					<p>– Эх, я не помню, точнее, не знаю. – ответил Оригинал.</p>
					<p>– Наверняка Восьмой даст ответ. – сказал Решительный и достал недавно убранный бластер, дабы его перезарядить.</p>
					<p>– Кто??? – спросил Оригинал. Он и понятия не имел, кто это и как его едят.</p>
					<p>– А. То-о-о-о-о-о-о-очно. Ты же не помнишь. – Решительный встал, глянув Оригиналу в глаза. – А не пора ли нам выполнить наш долг, а?</p>
					<p>– Какой долг?</p>
					<p>– А, да. Наша задача – уничтожить недостойные вселенные и дать место новым, более свежим и молодым мирам. Кто бы что ни говорил, а те миры должны себя показать. А те вселенные, как бы они не были многим дороги или важны... они должны быть истреблены. – сжал Решительный кулак. – Ты же тот, кто и поможет восстановить баланс в этом мире. Так что давай, – он протянул Оригиналу небольшой аметист, – возьми его и произнеси: «Восстань, Великий Дракон Грома!»</p>
					<p>Оригинал взял этот камень и положил в карман.</p>
					<p>– Хорошо. Раз это мой путь, то я буду следовать ему... – Оригинал неуверенно встал с земли, двинувшись куда-то в сторону горизонта.</p>
					<p>– Только не забудь как порталы открывать! – с насмешкой сказал Решительный.</p>
					<p>– Найду... О, вот! – Перед ними появился портал.</p>
					<p>– Тогда погнали! – Решительный прыгнул в портал, а за ним последовал и Оригинал.</p>
					<center><b>* * * </b></center>
					<p>???: Ну что, дорогой читатель, как тебе этот рассказ?</p>
					<p>Оригинал: Слушай, Статист, ты не ломай 4-тую стену, она и так проломлена до основания, теперь и ты ещё...</p>
					<p>Статист: Ой, да не начинай ты. Дыркой больше, дыркой меньше.</p>
					<p>Оригинал: Да, только потом нам за тебя такую кашу расхлёбывать...</p>
					<p>Статист: Извиняюсь... В общем, дорогие читатели, мы вам очень благодарны, что вы решили нас почитать. Я, Статист, буду рассказывать вам немного информации о персонажах. Ну, в принципе всё на сегодня...</p>
					<p>???: Слушай, Статист, а ты не знаешь, куда я спрятал кольцо?</p>
					<p>Статист: Какое кольцо?</p>
					<p>???: Ну то, с красненьким алмазиком посередине...</p>
					<p>Статист: Да не знаю я... Ты его у Оригинала поищи.</p>
					<p>Оригинал: А я откуда знаю?</p>
					<p>???: Бли-и-и-и-ин...</p>
					<p>Статист: Ну да... Подобное каждый день... Ладно, дорогие читатели. Спасибо за прочтение 1 главы, удачи, и... пока-пока. До следующей главы.</p><hr>
					<a href="0" class="link">← Предыдущая глава</a> / / <a href="2" class="link">Следующая глава →</a><br>
					<a href="../univers" class="link">Вернуться к списку рассказов</a>
				</div>
			</div>
		</div>
	</div>
	<?php include '../template/footer.html'; ?>
</body>
</html>