<!DOCTYPE html>
<html>
<head>
	<title>Глава 2</title>
	<link rel = "icon" href = "../img/unv.png">
	<link rel = "stylesheet" href = "../style/style_lit.css">
	<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
	<link rel="preconnect" href="https://fonts.googleapis.com">
	<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
	<link href="https://fonts.googleapis.com/css2?family=Montserrat+Alternates:wght@200;300&amp;display=swap" rel="stylesheet">
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<style>
		body{
			background-image: url(./fone/2.jpg);
		}
		hr{
		    color: #00FFFF;
		}
		.content-main{
			background-color: rgba(0,0,0,0.75);
		}
	</style>
</head>
<body>
	<div class="content-main">
		<div class="container">
			<div class="row">
				<div class="col-12">
					<div class="header">
						<h3 style="text-align: center; color: #FF00FF; font-family: serif;">Вселенская война. Глава 2. «Возрождение грома»</h3>
					</div>
					<p>Автор: DarkusFoxis.<br>Герои: Восьмой, Широ, Оригинал, Решительный, Статист, Даркус, 992к.<br>Возрастное ограничение: 6+.</p><hr>
					<center><p>(Измерение 9: Раскалённые земли. Место равнин, где нет ничего необычного... До первой ночи.)</p></center>
					<p>Пройдя в портал, они попали в... Правильно, не туда куда надо. Хотя, не удивительно, ведь Оригинал не очень контролирует свои новые способности. Так или иначе, попали не туда.</p>
					<p>– А что это за место то? – Оригинал оглядывался вокруг. – Так и выглядит измерение падших войнов?</p>
					<p>– Хе-хе, не-е-е-е, это веселее измеренице, – сказал Решительный, и достал бластер.</p>
					<p>– В каком смысле? С виду, обычная полянка, разве нет?</p>
					<p>– Хе-е-е, это только на первый взгляд.</p>
					<p>– В каком аспекте?! – Оригинал явно был не в восторге.</p>
					<p>– Ночью узнаем, а пока, давай-ка разожжём костёр, есть то охота.</p>
					<p>– С этим не поспоришь. Ну, благо тут есть куча деревьев, поэтому набрать дров для костра не проблема.</p>
					<p>– Ага, а есть то что будем? – спросил Решительный с ехидным смешком.</p>
					<p>– А это уже дело второе, т. к. когда будем собирать ветки, наверняка найдём и ягоды или грибы, а может и вообще, птиц или ещё каких-либо зверушек, – сказал Оригинал, подбирая первую попавшую ветку на глаза.</p>
					<p>– И ведь даже не поспоришь. Тогда вперёд!</p>
					<p>Оригинал и Решительный пошли в разные стороны, и долгое время был слышен только шорох травы и листьев. Через некоторое время можно было слышать: «Ну что я говорил? Я нашёл грибы!», «А я птиц нашёл!». Через некоторое время, Оригинал с Решительным встретились на той же равнине, где и появились. Они сложили свои находки рядом с собой.</p>
					<p>– Ну что, я набрал палок, грибов, ягод. В принципе, мне это измерение напоминает какую-то обычную равнину, которую я часто видел в майне, так что не могу сказать, что это какое-то необычное измерение, – сказал Оригинал, чеша затылок. – А ты что набрал?</p>
					<p>– Я набрал: палок, веток, ягод каких-то, немного поохотился на птиц, грибочков, – сказал Решительный, достав бластер. – А насчёт того, что ты сказал про это измерение, я же говорил, что вся веселуха начнётся ночью?</p>
					<p>– Да говорил, но до ночи ещё долго, – сказал Оригинал, и смотрит на свой прибор. – Понять бы ещё, как этой штукой пользоваться...</p>
					<p>– Хе, скоро поймёшь.</p>
					<p>– И то верно, ладно, теперь надо бы разложить костёр, и хотя бы пожарить птицу.</p>
					<p>– Да что ты паришься? Денёк, а то и меньше по голодаем, и норм будет, – Решительный развёл руками.</p>
					<p>– Не сказал бы так. Мне интересно, как поведёт прибор, да и самому есть то охота, так ведь?</p>
					<p>– Ты читаешь мысли. Давай тогда!</p>
					<p>Оригинал начал складывать костёр, но не смог найти в кармане спичек.</p>
					<center><b>* * * </b></center>
					<p>Статист: – Эй, сервер!!!</p>
					<p>Статист начал перезагружать сервера, дабы те начали работать, но что бы он не делал, всё без толку. К Статисту подошёл Оригинал.</p>
					<p>Оригинал: – Ну так... Что произошло с серверами?</p>
					<p>Статист: – Как я понял, перегружены. Но я их перезагружал много раз, всё без толку.</p>
					<p>Оригинал: – Ну так, зачем ты на сервера заливать нашу историю? Ты же знаешь, что они могут перестать отвечать в любой момент, и тогда как ты её зальёшь?</p>
					<p>Статист: – Ну... Я об этом как-то не думал... Ведь по статисти...</p>
					<p>Оригинал протянул Статисту флешку на 128 гб.</p>
					<p>Оригинал: – Вот, держи.</p>
					<p>Статист глянул на флешку, а после на Оригинала, потом опять на флешку, и снова на Оригинала, а после снова на флешку, и опосля на Оригинала.</p>
					<p>Статист: – Эм...</p>
					<p>Оригинал: – А ты думал я сразу начинал с серверов делать нам морферы?</p>
					<p>Статист: – Да нет... Я подобного ожидал...</p>
					<p>Оригинал: – Тогда давай. Это практичнее.</p>
					<p>Статист взял флешку, и подключил к устройству. Что-то сделал в программе, и вуаля, всё снова прекрасно работает.</p>
					<p>Оригинал: – Сегодня гляну, что с серверами... А то они часто барахлят.</p>
					<p>Статист: – Ага. А пока, я продолжу запись.</p>
					<p>Оригинал ушёл, а Статист продолжил свой рассказ.</p>
					<center><b>* * * </b></center>
					<p>Оригинал начал складывать костёр, но не смог найти в кармане спичек.</p>
					<p>– Да где они… – Оригинал начал ощупывать все карманы. – Слушай, Решительный, а у тебя случайно огонька не найдётся, а то похоже я в лесу потерял спички.</p>
					<p>– Да не вопрос! – Решительный достал бластер, и начал крутить барабан, и спустя пару круток выстрелил в костёр, и тот вспыхнул ярким пламенем. – Тадам.</p>
					<p>– Ого, интересно, а моя штука подобное может?</p>
					<p>– Вряд ли, но ты можешь круче! – Решительный вернул бластеры на ремень. – Но это ты поймёшь через некоторое время.</p>
					<p>– Поскорей бы. Ладно, давай грибы доставай, а я ещё хвороста с дровами подкину.</p>
					<p>Через пару десятков минут Оригинал и Решительный уже готовили прекрасный перекус. Наверно, каждый хотел бы побыть на их месте. И не удивительно: светит вечернее солнце, тёплый лёгкий ветерок приятно дует в спину, тем самым не давая перегреться. Приятный запах костра, который пропитывает грибы, жарящиеся над костром. В общем, мечта каждого любителя поесть на природе. Хоть разбивай лагерь. Но ночь медленно надвигалась. Несмотря на это, темнеть даже и не думало, ну а что, лето на дворе. Оригинал решил немного вздремнуть на траве, и попросил Решительного его разбудить через пару часиков или тройку. На что тот ответил: «Не беспокойся, когда придёт время, ты сам проснёшься». Оригинал не придал значения этим словам, и через некоторое время уже видел сны. Сны были прекрасными, где он посещает страну, в которой он давно мечтает побывать: Япония. В этом сне он видит, как гуляет по весенним улицам мечты, и прекрасный дождь из лепестков Сакуры. Как в парках сидят японцы, и отмечают праздник Ханами. В воздухе улавливаются нотки цветов, которые дают понять, что ты практически в раю и вот причина, из-за которой стоит жить на этом свете, ведь такой красоты больше нигде не найти. Но, этот сон длился не долго. Через некоторое время раздалось оповещение о ядерной атаке, а через некоторое время раздался громкий взрыв. Из-за него, земля провалилась, и Оригинал проснулся в холодном поту.</p>
					<p>– О, как раз вовремя, – сказал Решительный.</p>
					<p>– В смысле? – Оригинал вытирал пот с лица.</p>
					<p>– На небо глянь.</p>
					<p>Оригинал поднял голову, и немного был удивлён. Кровавая луна освещала всю местность, а облака больше походили на сгустки крови, которые плыли по небу. Вдобавок к этому, стояла вокруг гробовая тишина, которая только навевала ужас. Вся листва на деревьях, трава, земля, и остальная растительность была кровавого оттенка, даже вода больше походила на кровь.</p>
					<p>– Что происходит? Что случилось? – в недоумении спрашивал Оригинал.</p>
					<p>– Наступает ночь, в которой мы должны найти ещё одного клона. Правда не твоего. – сказал Решительный, начав крутить на бластере барабан.</p>
					<p>– В смысле, а чь…</p>
					<p>– Пригнись!</p>
					<p>Оригинал моментально отскочил, а Решительный выстрелил в чёрта, который замахнулся ножом, но не успел нанести удар, и в него прилетел лазерный выстрел.</p>
					<p>– Откуда они?... – сказал Оригинал с испугом.</p>
					<p>– Начали вылезать, надо идти к горе, там точно будет адский разлом, а если найдём его, то и того, кто нам нужен, сможет достать, – сказал Решительный, доставая второй бластер.</p>
					<p>– Тогда пошли, и да, прикрой меня пожалуйста, а то у меня оружия то нет от слова вообще, – сказал Оригинал.</p>
					<p>– А ты пробовал его призвать? – с небольшой насмешкой сказал Решительный.</p>
					<p>– А как?</p>
					<p>– Вытяни руку, и скажи какую-то комбинацию слов, я не помню уже какую, ведь ты как-то и без них справлялся, – Решительный почесал затылок, пытаясь что-то вспомнить.</p>
					<p>– Хорошо, – Оригинал вытянул руку. – Э… Оружие достовайтус!</p>
					<p>Но ничего не произошло. А Решительный начал кататься от смеха по траве.</p>
					<p>– Ничего не пони… – у Оригинала что-то в голове промелькнуло. – А… Слушай, Решительный, я не понимаю как достать.</p>
					<p>– Ладно, пошли, потом разберёшься, – с небольшим смешком в голосе сказал Решительный, и он с Оригиналом продолжили путь.</p>
					<p>Они решили идти прямо к горе, напролом. По первой никого на пути они не видели, но буквально спустя пару метров чертей было столько, что Решительный еле с ними справлялся, а Оригинал стоял за ним, не понимая, как помочь. Спустя буквально 10 сантиметров чёртов было столько, что они окружили наших героев кольцом толщиной с пятиэтажный дом.</p>
					<p>– Чёрт побери, их тут слишком много, хотя я знаю как их убрать с пути, – Решительный начал крутить барабан на бластер.</p>
					<p>– Что ты задумал? – Оригинал насторожился.</p>
					<p>– Не бойся, а лучше готовься, – Решительный направил оба бластера в воздух. Из его глаз начал идти красное пламя. – Звёздный дождь веры!</p>
					<p>Над Решительным появилась непонятная печать, в которую он сделал выстрел из двух бластеров, и над головами всех начался настоящий звёздный дождь. Оригинал, как будто что-то вспомнил, и прокричал: «Щит вечности!», и вокруг Решительного и Оригинала появился защитный купол, который защитил их от падающих звёзд. Через секунду, от чёртов не осталось и намёка.</p>
					<p>– Ха, всё таки начал вспоминать? – Решительный спросил с насмешкой.</p>
					<p>– Похоже на то… Раз это сработало, то должно получиться и… – Оригинал поднял руку с прибором, и барьер вернулся в него. – Хм, сработало. А если так… – Оригинал поднёс руку, как будто что-то держал к камню в центре прибора, и начал тянуть. Из него показалась рукоять, и часть лезвия. – Работает! – вскрикнул наш герой, и резко дёрнул, схватив за рукоять. Из прибора вылез меч, из которого шли небольшие молнии. – Вот моё оружие!</p>
					<p>– Ага, теперь мы точно… Пригнись!!!</p>
					<p>Оригинал пригнулся, и прям у его спины пролетели кунаи.</p>
					<p>– Слушай, ты чего палишь контору раньше времени? – послышался голос из темноты.</p>
					<p>– Если цена молчание это смерть, уж извини, но я пас, – сказал Решительный, приготовив бластеры.</p>
					<p>– Ну что ты, мы разве не друзья? – из тьмы показался человек, отдалённо напоминающего Оригинала, и с рогами. – Я ведь прав, Решительный?</p>
					<p>– Даркус, а мы как раз за тобой.</p>
					<p style="color:#DAA520;">(Новый персонаж: Даркус.)</p>
					<p style="color:#DAA520;">(Даркус – демон, что не может завершить ни одну драку без убийства и/или крови. Зачастую он и начинает их. Маниакальная улыбка говорит о том, что он любит кровь, и то что ты его цель на сегодня. Но будем честны, он только прикидывается маньяком, а настоящего его никто не видел.</p>
					<p style="color:#DAA520;">Характер: с виду маньяк маньяком, но на самом деле неизвестно.</p>
					<p style="color:#DAA520;">Рост: 181 см.</p>
					<p style="color:#DAA520;">Тотемный зверь: きつね.)</p>
					<p>– Хе, я ждал, – Даркус подошёл к Оригиналу. – Ведь я учуял знакомую мне магию.</p>
					<p>– Хорошо… – Оригинал выпрямился. – Раз мы нашли и того, кого мы искали, может мы пойдём далее?</p>
					<p>– Хе, а почему бы и нет? – Решительный повернулся к Даркусу. – Ну а ты, рогатый, пойдёшь с нами?</p>
					<p>– А почему нет, вы же за мной шли, с какой стати я должен оставаться?</p>
					<p>– Ну, раз такой расклад, то… – Оригинал поднял руку с прибором. – Пора продолжить путешествие.</p>
					<p>Открылся портал, и наши герои вошли в него.</p>
					<center><b>* * * </b></center>
					<p>{Далее рассказ идёт от лица: Статиста.}</p>
					<p>– Фух… Я устал. Так, надо пройтись, а то так точно прирасту к стулу, – сказал я, и направился в сторону выхода.</p>
					<p>Выйдя из своей комнаты, я был неприятно удивлён. На улице уже стемнело, а в коридоре горел свет, явно давая понять, что никто и не думает спать, и даже не готовятся к тому, чтобы уйти в кратковременную спячку. Ну я пошёл в сторону комнаты Восьмого и Широ. Они сидели возле своей комнаты.</p>
					<p>– Привет Восьмой, привет Широ, а чего не спите?</p>
					<p style="color:#DAA520;">(Новый персонаж: Восьмой.)</p>
					<p style="color:#DAA520;">(Восьмой – лис с двумя хвостами. Его особенность в том, что он не может использовать атакующие заклинания, кроме призывающих и лечащих. А вместо маны тратятся жизненные силы, но немного. Достаточно мягкий, и не любит драки, поэтому старается обходить места драк стороной, чтобы не попасть под горячую руку.</p>
					<p style="color:#DAA520;">Характер: мягкий, миролюбивый. Всегда и, зачастую, всех прощает, и старается найти компромисс со всеми.</p>
					<p style="color:#DAA520;">Рост: 175 см не включая уши.</p>
					<p style="color:#DAA520;">Тотемный зверь: Дракон Хронос.)</p>
					<p style="color:#DAA520;">(Новый персонаж: Широ.)</p>
					<p style="color:#DAA520;">(Широ – лисица/кицунэ, которая практически всегда находится рядом с Восьмым. Достаточно весёлая и ласковая, поэтому с ней вы поладите на все 100.</p>
					<p style="color:#DAA520;">Характер: ласковая и милая</p>
					<p style="color:#DAA520;">Рост: 140 см не включая уши.</p>
					<p style="color:#DAA520;">Тотемный зверь: кицунэ.</p>
					<p style="color:#DAA520;">P.S.: Персонаж взят из аниме: «Sewayaki Kitsune no Senko-san», и переделан под рассказ.)</p>
					<p>– Привет, Статист, – сказали оба.</p>
					<p>– Ну, я не сплю, потому что не могу уснуть, плохое предчувствие у меня… – сказал Восьмой, прижав уши.</p>
					<p>– А я решила посмотреть, почему Восьмой не спит, вот и не сплю вместе с ним, – сказала Широ.</p>
					<p>– Восьмой, мы же оба знаем, что единственный, чьи предчувствия сбываются, так это Темиса и… А, и твои тоже. А что за предчувствие?</p>
					<p>– Надвигается что-то опасное, и это что-то знакомо кому-то из нас, – сказал восьмой, вернув второй хвост.</p>
					<p>– А, так это скорее всего Рен и Темис, – сказал я, раскрыв блокнот, который у меня всегда неподалеку, и в которой я записываю практически всё, что происходит на корабле. – Хотя, они бы сообщили, что придут.</p>
					<p>– Вот именно, а они не сказали, от того и плохое предчувствие, – сказал Восьмой, насторожившись. – Что-то случится, прямо сейчас.</p>
					<p>– Восьмой, по моему это уже паранойя, никак иначе, – сказал я, пряча блокнот в сумку.</p>
					<p>– Похоже на то… Ошибся, наверное, – сказал Восьмой, опустив уши.</p>
					<p>– Ну не грусти, с каждым бывает, верно ведь? – сказала Широ, обняв Восьмого.</p>
					<p>– Опять эта неж…</p>
					<p>Не успел я договорить, как где-то произошёл взрыв, который неплохо встряхнул корабль, и начался сигнал.</p>
					<p>– Ай, что происходит?! – сказал я, и побежал к пульту управления, где уже были Оригинал, 992к, и Решительный. – Ребят, что за встряска?!</p>
					<p>– Похоже, была атака где-то в районе двигательной части, – сказал Оригинал, смотря на панель. – Но по моему, атака была проведена с земли, исходя из того, что я не вижу способа как-либо попасть по нам с воздуха, а тем более, попасть на корабль.</p>
					<p>– Солидарен с Оригиналом, я проверил, и никого на корабле не обнаружено посторонних, – сказал Решительный, смотря на второй монитор.</p>
					<p>– Предлагаю посмотреть, что это за снайпер, и по надобности, отправить восвояси – сказал 992к.</p>
					<p style="color:#DAA520;">(Новый персонаж: 992к.)</p>
					<p style="color:#DAA520;">(992к – лучший маг, и поддержка. Вместе с Оригиналом и Решительным образует прекрасную команду, а сам по себе может неплохо разбить толпу.</p>
					<p style="color:#DAA520;">Характер: пессимист. Часто может видеть то, чего нет на самом деле, что помогает определить будущее.</p>
					<p style="color:#DAA520;">Рост: 178 см.</p>
					<p style="color:#DAA520;">Тотемный зверь: Отсутствует.)</p>
					<p>– Ну, тогда давайте, собирайтесь, – сказал Оригинал, и начал готовить аппарат по переносу.</p>
					<p>Естественно мне нужно было ему помочь, т. к. он один не справится, ведь этот аппарат нужно настраивать сразу в нескольких местах: на нём самом и на компьютере управления. Через несколько минут раздалась повторная сигнализация, которая сигнализировала в том же месте, что и первая. В итоге, через некоторое время мы подготовили аппарат переноса, и команду, состоящую из меня, Оригинала, 992к, Решительного, Восьмого и, как не странно, Широ.</p>
					<p>Активировав аппарат, мы были перенесены под корабль на землю.</p>
					<p>– А тут темно… – сказал Восьмой, призвав лисьи огни, которые прекрасно освещали путь.</p>
					<p>– А ты как хотел, корабль своей площадью загородил здесь солнечный свет, поэтому тут так и темно, – ответил я.</p>
					<p>– Именно в темноте зачастую и прячется зло, ведь под пеленой тьмы злодеяния не видны, и раскрываются только на свету, – сказал 992к, как-то пристально всматриваясь в темноту.</p>
					<p>Путь по темноте был недолгий, и вскоре мы вышли на свет. Но 992к всё продолжал смотреть в тень.</p>
					<p>– Слушай, 992к, ты эту тень глазами прожечь собираешься?</p>
					<p>– Если понадобиться, то и прожгу.</p>
					<p>– А не эффективней было бы просто осветить лисьими огоньками? – сказал Восьмой.</p>
					<p>– Есть способ проще, например… Кто это? – сказала Широ, указывая на девочку.</p>
					<p>– О нет… – сказал Оригинал.</p>
					<p>– О да, брат Имран, – сказала девочка.</p>
					<p>– Ну здравствуй, сестра Наокки, – сказал Оригинал.</p>
					<p>– Сестра?! – все, кроме Наокки и Оригинала вскрикнули.</p>
					<p>– Да, и раз уж мы встретились, – Наокки достала веер, – может мы начнём игру?...</p><hr>
					<a href="1" class="link">← Предыдущая глава</a> / / <a href="3" class="link">Следующая глава →</a><br>
					<a href="../univers" class="link">Вернуться к списку рассказов.</a>
				</div>
			</div>
		</div>
	</div>
	<?php include '../template/footer.html'; ?>
</body>
</html>