<!DOCTYPE html>
<html>
<head>
	<title>Глава 3</title>
	<link rel = "icon" href = "../img/unv.png">
	<link rel = "stylesheet" href = "../style/style_lit.css">
	<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
	<link rel="preconnect" href="https://fonts.googleapis.com">
	<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
	<link href="https://fonts.googleapis.com/css2?family=Montserrat+Alternates:wght@200;300&amp;display=swap" rel="stylesheet">
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<style>
		body{
			background-image: url(./fone/3.jpg);
		}
		hr{
		    color: #00FFFF;
		}
		.content-main{
			background-color: rgba(0,0,0,0.75);
		}
	</style>
</head>
<body>
	<div class="content-main">
		<div class="container">
			<div class="row">
				<div class="col-12">
					<div class="header">
						<h3 style="text-align: center; color: #FF00FF; font-family: serif;">Вселенская война. Глава 3. "Возрождение грома"</h3>
					</div>
					<p>Автор: DarkusFoxis.<br>Герои: Оригинал, Наокки, Шимрель, Восьмой, Широ, Решительный, Статист, Даркус, 992к.<br>Возрастное ограничение: 6+.</p><hr>
					<p>{Рассказ идёт от лица: Оригинала.}</p>
                    <p>"Как… Я же думал, она умерла… Она при мне же тогда лежала не дыша…", я не мог поверить в то, что Наокки жива, хоть и верил в это, но она перешла на сторону против нас. Я начал погружаться в воспоминания, чтобы понять, в чём причина перехода…</p>
                    <center><b>* * *</b></center>
                    <p>-Имран! Проснись! - будила меня сестра, толкая меня из стороны в сторону.</p>
                    <p>-Сейчас, Наокки, сейчас… - нехотя и через силу я начал вставать с постели.</p>
                    <p>-Доброе утро, Имран! - набросилась на меня сестрёнка, и крепко обняла.</p>
                    <p>Она меня всегда так будила, и хоть для меня она сестра, многие считают меня её отцом, потому что я был совершеннолетним. Да и я не был против. Для меня она была дорога, ведь по ней я мог найти наших родителей. Её волосы, словно шёлк, развивались при её любых движениях. Она была небольшого роста, примерно 167 см. Но, к сожалению, она болела раком, и я не хотел с ней расставаться, поэтому её не положил в больницу. Да и стадия рака была не настолько критичной, чтобы её лечили только в больнице, нам удавалось сдерживать болезнь, поэтому ситуация не усугублялась, а наоборот, становилась лучше и лучше. Да и Наокки не теряла оптимизм, и была уверена, что сможет победить недуг, хотя буду честен, я не был уверен в этом, хотя очень этого хотел.</p>
                    <p>-Доброе утро, Наокки. Как твоё самочувствие? - спросил я, гладя её по волосам.</p>
                    <p>-Отличное! И я даже успела приготовить нам завтрак! - ответила Наокки.</p>
                    <p>-Хорошо, молодец, тогда сейчас позавтракаем, и пойдём в школу.</p>
                    <p>-А я уже и рюкзак собрала. Ещё вчера, когда ты писал что-то.</p>
                    <p>-Да, помню, ох, голова болит, зря я взялся за этот проект... Ночью не спал почти… Хоть закончил.</p>
                    <p>-Сегодня ляжешь пораньше. А то я буду беспокоиться за тебя.</p>
                    <p>-Постараюсь. Так, а теперь завтракать.</p>
                    <p>Так проходило обычно моё утро. Я уже и не помню, как давно она научилась готовить, но помню точно, готовила она просто прекрасно. Ходили мы в одну и ту же школу, поэтому, не дай бог случится что-то с ней, я смогу добежать до неё, и отвести к медсестре, которая знает положение сестры, и её проблемы. Если не касаться проблемы Наокки, то у нас был обычный учебный процесс, ничем не отличавшийся от других. Я на тот момент уже был в 9 классе, и считался в классе зубрилой. Хотя я ничего не зубрил, просто пытался вникнуть в тему и понять её, но сколько бы я не пытался объяснить, всем на это было всё-равно. Но, я к этому давно привык, поэтому и просто продолжил учиться как и раньше. У меня друзей почти не было, кроме парочки, и то из класса Наокки. С ними даже интересно было, они иногда приходили к нам, и мы вместе делали уроки, я им помогал, а после играли в игры. Но, тот день был интересней…</p>
                    <p>-Имран Хекстович, можешь подойти после уроков? - спросил меня учитель по химии Олег Петрович.</p>
                    <p>-А нужна помощь? Просто сегодня я с Наокки должны пойти на обследование, - ответил я, немного раздражённо.</p>
                    <p>-Не совсем помощь, больше как интерес для тебя, - ответил Олег Петрович.</p>
                    <p>Я немного тогда был ошеломлён, ведь я не понимал, что за интерес. У меня много интересов было, например робото и радиотехника, химия, математика, и литература. Что для меня могло быть интересного в химии на тот момент, я даже не мог представить.</p>
                    <p>-Можно на другой день? - ответил я. Всё же, Наокки была для меня важнее.</p>
                    <p>-Если хотите, могу с урока забрать, - ответил  учитель.</p>
                    <p>Вообще, сейчас должна была быть история, но я её не очень любил. Не люблю я копаться в датах, и войнах…</p>
                    <p>-Ну… Хорошо, я согласен.</p>
                    <p>-Отлично! Это может продвинуть науку вперёд! Ваш вклад будет бесценен!</p>
                    <p>Я понимал, что это какая-то глупая затея, поэтому не на что не надеялся, но только из-за пропуска истории я и согласился. Впрочем, как он и обещал, он забрал меня с истории, и повёл в кабинет химии. По дороге он рассказал, что я единственный, кто в химии разбирается также, как и он, а то и лучше, поэтому должен помочь. В это я верил с трудом, хотя, может это и так, я не знал, и до сих пор не знаю. Пройдя в кабинет химии, он достал какой-то камень, похожий на сапфир.</p>
                    <p>-Вот! Сегодня будем работать с ним! - восклицал он.</p>
                    <p>-Это обычный сапфир… Он же и так изучен с ног до головы, зачем изучать дальше? - уже с недоверием спросил я.</p>
                    <p>-Тонко мыслите, друг мой, очень тонко, - ответил он, достав металлическую пластинку. -Вот что это по вашему?</p>
                    <p>-Обычная железная пластина.</p>
                    <p>-А вот камень думает ин…</p>
                    <p>-Стоп, стоп, стоп! В смысле думает? У него есть разум? - немного в недоумении спросил я.</p>
                    <p>-Обычные камни нет, а вот этот, - начал как бы втыкать в камень пластину, -очень даже может быть.</p>
                    <p>На моих глазах, пластину начал поглощать камень сапфира. Такое чувство, что это не камень, а пластилин, но нет, это был самый обычный сапфир. Я просто стоял, и не мог произнести не слова. В это время, этот камень полностью поглотил пластину.</p>
                    <p>-Как тебе? Впечатляет, не правда ли? - сказал учитель, словно гордясь этим. -Но даже это ещё не всё!</p>
                    <p>Я и так ещё не отошёл от увиденного, а после слов учителя, мой разум начал думать, словно это сон.</p>
                    <p>-Вот скажи, пластина была острой или же нет?</p>
                    <p>Я молча кивнул, словно был немой, и не мог ответить точно.</p>
                    <p>-Уже удивлены настолько? Хотя вас сложно удивить, но сегодня мне удалось. И так, смотрите!</p>
                    <p>Он при помощи пинцетов стал доставать пластину, и я заметил, что она была заострённой, хоть и отчётливо помнил, что она была абсолютно тупой, какой обычно и бывают пластины.</p>
                    <p>-Как такое может быть?! - спросил я, в недоумении.</p>
                    <p>-Наука не может объяснить подобное, но с этим камнем, мы сможем сделать множество открытий и новых изобретений! - воодушевлённо воскликнул Олег Петрович. -Ну что, Имран Хекстович, вы согласны мне помочь с исследованиями?</p>
                    <p>Я молча кивнул. Возможно, это и правда могло продвинуть науку вперёд, но для меня была важнее Наокки. На уроке мы работали над этим сапфиром, проводили через него электричество, окунали в воду, в общем, что мы с ним только не делали. В итоге, он раскололся на 2 части. И одну часть Олег Петрович мне отдал со словами:</p>
                    <p>-Держи, теперь ты можешь над ним экспериментировать и дома, не отходя далеко от сестры.</p>
                    <p>Не могу сказать, что я не рад, наоборот, но всё же мне не давала покоя сестра. Я за неё переживал очень, ведь рак - приговор. И не смотря на то, что она чувствует себя прекрасно, стоит хоть на минуту упустить хоть 1 момент… И нельзя предугадать, или всё обойдётся, или наоборот, Наокки будет мучиться…</p>
                    <p>После истории мы шли домой, и я зашёл за Наокки, которая меня уже ждала в холле. Далее мы пошли на обследование. Погода была прекрасная: Птички пели свои весенние песни,  а ветки деревьев, на которых листья уже распустились, подыгрывали птицам. Ветерок приятно дул в спину, и тем самым пускал приятную прохладу, а солнышко грело своими лучами, не позволяя замёрзнуть. Весь этот весенний пейзаж, поднимал нам настроение, несмотря на проблемы Наокки. Да и она была весёлой, и по дороге собирала одуванчики, её любимые цветы. Эти цветы солнца тоже согревали нас, но не тело, а душу. И в таком темпе мы пришли в больницу. Обследование прошло быстро, что не могло не радовать. На нём сказали, что Наокки идёт на верную поправку. Придя домой, мы быстро пообедали, и примерно за час сделали уроки. После уроков, мы обычно играли, но сегодня я решил немного уделить время этому камню. Моя сестра сама отказалась играть, т. к. хотела жутко спать, поэтому, я спокойно взялся за его изучение. Мучился я над ним где-то час, а то и два, но ничего нового я о нём не узнал, как бы я не старался. И решил попробовать его расколоть на кусочки поменьше. Но, только я взял молоток, как тут же он начал сиять ярче лампы, которая стояла у меня на столе. Я зажмурился, выронив молоток. Свечение продолжалось ещë около 10 секунд, а после стихло. "Что за чертовщина…", подумал я про себя, взяв камень в руки и начав рассматривать его. Я заметил, что  какая-то часть камня стала чëрной. Я взял стамеску, и аккуратно сколол эти чëрные частички камня, и отложил их в сторону, меня больше интересовала нетронутая часть камня. Но сколько бы я не замахивался на этот камень, он не сиял больше. Я конечно расстроился, но решил сделать небольшое украшение для меня и сестры. Наокки очень любила ожерелья, кулоны, поэтому для неë я выбрал кулон, сделал заготовку, и начал работу. Почти полночи убил на этот кулон, надеясь на то, что камень вновь покажет свои магические способности, но ничего особенного он так и не показал. Для себя я решил сделать что-то наподобие браслета со вставкой из этого камня, как сердце браслета. Сделал за час, ведь уже не надеялся что-то увидеть, да и делал самый простой браслет. Если быть честным, то я и не хотел делать для себя браслет, но зная Наокки, она тогда просто напросто не примет кулон. Я не знаю, как это работает, но она хочет чтобы и я себя не оставлял без подарков.</p>
                    <p>Начало светлеть, и светлело не по часам, а по минутам. У меня из окна прекрасный вид на восход, и я всегда любил смотреть на него. Смотря на солнце, мне всегда казалось, что в этот момент может случиться что-то прекрасное, и неожиданное, ведь момент наступление утра- зарождение нового дня. Тогда почему в честь этого не произойти чему нибудь приятному? Я понимал, что это всего лишь мечта и надежды, но ребëнок во мне всë ещë процветает, и вряд ли когда повзрослеет… однако я чувствую, что скоро мне предстоит сложный выбор, но какой…</p>
                    <p>Меж тем солнце уже разбудило мою сестру, и я решил, что пока рано дарить кулон, ведь он не совсем был готов, как оказалось, и спрятал в комод, вместе с моим браслетом, дабы не оставить следов моих задумок.</p>
                    <p>Утро ничем не отличалось от обычного, который мы проводим каждый день: Я приготовил завтрак, и помог Наокки собраться в школу. После дорога в школу, и начало учёбы. Но, меня опять посреди учебного дня забрал Олег Петрович. Мы снова с ним ставили опыты над этим камнем. Я сказал, что камень излучал странное свечение, и мы пытались его снова повторить, но сколько бы мы не пробовали, ничего не получилось. Словно тот случай повлиял на все камни. Но, может даже это и было правдой. Так или иначе, мы провели не только эксперимент по попытке возвращения свечения, но и ряд других, не менее интересных, экспериментов: реакция камней на ток,  взаимодействие с другими металлами, их огнеустойчивость и похожие. И в этот день, я снова пропустил все уроки, хотя обычно на них мне всё равно было скучно.</p>
                    <p>Но, мне и Наокки ещё пришлось сходить в больницу, и только после этого мы вернулись домой. Честно говоря, никогда не думал, что скажу, но тот день был самым чудесным…</p>
                    <p>Последующее событие просто выбило меня из течений дня… В ту ночь я наконец завершил кулон для моей сестры, и принялся за свой браслет. Но, как только мои руки коснулись камня, мой разум наполнился огромным количеством знаний, словно этот осколок хранил в себе миллионы библиотек из разных точек мира. И я понял, что этот сапфироподобный кристалл пытался донести до меня. Я принялся за создание компьютера для него. В попытке его создания, мне пришлось закрыться у себя, и Наокки пришлось жить самой. Я полностью потерял линию жизни, времени, и существования, у меня была исключительно 1 цель: достать все знания и возможности этого камня. Мне пришлось забыть обо всём, для достижение её: о существовании сестры, о походе в школу, о больнице, и о потребности во сне и еде. Будто того меня подменили на робота, который только работал, и не пытался скрыть, что он не робот. Я работал, нет, пахал каждый день по 24 часа. Через 3 дня мне удалось сделать основу и компьютер для руки под этот сапфир. На вид эта конструкция выглядела как какой-то металлический щит, и с такой штукой вряд ли было нормально гулять по улице. Я одел его, и по весу он был не тяжёлый, а скорее неудобный, но думаю, смог бы привыкнуть. Моя рука потянулась к сапфиру, но стоило мне прикоснуться к нему, как тот тут же сам взмыл к щиту, и сам встал в место для него, и в ту же секунду мой мозг отключился…</p>
                    <p>Сколько я провёл в таком состоянии, я не знаю, но я очнулся от звонка на телефон.</p>
                    <p>-Алло? - сказал я.</p>
                    <p>-Здравствуйте, это Имран Хекстекович? - услышал я голос врача, к которому мы с Наокки ходили на обследование. И тут я запаниковал…</p>
                    <p>-К-константин Викторович? Скажите, что там с Наоккки! - вскрикнул я, боясь, что слишком поздно спохватился.</p>
                    <p>-Как раз по поводу неё я и звоню, - ответили мне. -Приходите в больницу, вы должны будете подписать документы на отключение аппарата жизнеобеспечения.</p>
                    <p>В тот миг, мой мир полностью обрушился. Я ничего не смог ответить, и выронил телефон из руки, и конечно слышал ещё какие-то слова, но пропускал их мимо ушей. В тот миг все мои мысли были о том, что не надо было соглашаться на создание этого компьютера. Я просто корил себя, но пришлось собраться, и, не снимая этого аппарата, направился в больницу.</p>
                    <p>Придя туда, я попросил провести меня к Наокки. Она оказалась на втором этаже, но для меня это было не так и важно. У меня была одно желание: увидеть её хотя бы в последний раз. Как только я прошёл в её палату, моему взору предстала Наокки. Даже сейчас, она боролась за жизнь, хоть этого не было видно, но моё сердце чувствовало.</p>
                    <p>-Извините, а можно не отключать?... - спросил я, с надеждой.</p>
                    <p>-Прости, но мы не можем держать её так вечно, - ответил мне Константин Викторович. -Мы пытались помочь в твоё отсутствие, но всё было бесполезно.</p>
                    <p>Я полностью потерялся в мыслях. С одной стороны, мне крайне не хотелось убивать её собственноручно, но с другой… У меня не было выбора.</p>
                    <p>-Хорошо… Дайте мне документы, - сказал я твёрдо. -И ещё… Позвольте мне самому отключить.</p>
                    <p>-Вы хотите это сами сделать? - спросил врач.</p>
                    <p>-Да, я не уследил, пусть и её смерть будет на моих руках… - ответил я, и повернулся к врачу.</p>
                    <p>Мне предоставили документы, и сказали как отключить аппарат, и дали полчаса на то, чтобы я мог попрощаться, и отключить аппарат. Я подошёл к Наокки, и достал кулон. Этот кулон я должен был подарить ей на утро, но в тот день мои мысли были полностью неподвластны моему разуму.</p>
                    <p>-Прости меня, Наокки… - сказал я, и поместил кулон ей на грудь, прикрыв его её руками. -Это я должен был отдать тебе намного раньше, но ведь лучше поздно чем никогда, так?...</p>
                    <p>Мне было так противно слышать свой голос, но я старался поговорить с сестрой хотя бы в последний раз, хоть и понимал, что вряд ли услышу хотя бы словечко в ответ.</p>
                    <p>-Прости… Но я должен это сделать… - сказал я, и потянулся к вилке аппарата жизнеобеспечения. -Надеюсь, ты сможешь простить меня за это…</p>
                    <p>Я выдернул вилку из розетки. Через пару секунд, я услышал протяжный пик аппарата измеряющего сердцебиения. Наокки полностью была мертва…</p>
                    <center><b>* * *</b></center>
                    <p>-Оригинал, с тобой всё хорошо? - обратился ко мне Восьмой.</p>
                    <p>-А… Да, прости, - ответил я. -Просто вспомнил прошлое…</p>
                    <p>Я начал подходить к Наокки.</p>
                    <p>-Сестра, я очень рад видеть тебя, но…</p>
                    <p>-Тебе интересно, почему я жива так? - перебила меня Наокки.</p>
                    <p>-Да, - ответил я, и остановился.</p>
                    <p>-За это надо благодарить меня, - из-за спины Наокки вышла женщина с кошачьими ушами.</p>
                    <p>-А ты кто? - насторожился я.</p>
                    <p>-Ах, где мои манеры? - сказала она с сарказмом. -Меня звать Шимрель. Но так-то ты меня должен был запомнить, как ту, кто спасла твою сестру от смерти, в то время как ты бросил её.</p>
                    <p>-Я не помню тебя, - ответил я, пытаясь вспомнить её.</p>
                    <p>-Давай я помогу тебе напомнить, - сказала она, и в этот миг я начал погружаться намного глубже в свои мысли…</p>
                    <center><b>* * *</b></center>
                    <p>Я смотрел на бездыханное тело сестры. Мои мысли были все в одной куче, и просто не понимал, как до такого дошло…</p>
                    <p>-Мяу, - я услышал за моей спиной какое-то мяуканье.</p>
                    <p>Обернувшись, я увидел на подоконнике кошку.</p>
                    <p>-Как ты сюда попала? - спросил я, смотря на это чудо.</p>
                    <p>Мы пересеклись взглядами, и в ней я будто видел свою сестру. Она смотрела так же, как когда-то моя Наокки, и будто бы была её реинкарнацией. Но как так быстро?</p>
                    <p>-Эх, если бы моя сестра сейчас была бы жива… - сказал я, посмотрев на тело Наокки.</p>
                    <p>Кошка прыгнула на её бездыханное тело, будто изучая его. Я смотрел на них, и тяжело вздохнул. А эта пушистая подруга легла на кулон Наокки.</p>
                    <p>-Да, если бы это было возможно, то многие люди давно бы вернули к жизни своих родных и близких… - сказал я, направляясь к выходу.</p>
                    <p>И тут мой сапфир засиял, что я аж ослеп, и буквально через пару минут сияние прекратилось. Я обернулся, и увидел женщину с кошачьими ушками и хвостом, которая забирала тело Наокки, но та подавала признаки жизни.</p>
                    <p>-Эй, кто ты! - крикнул я, и нажал на кнопку тревоги. -Верни сестру на место!</p>
                    <p>-Как грубо, сказала женщина, и положила Наокки на кушетку. -Меня звать Шимрель, и я пришла отомстить тебе, убийца.</p>
                    <p>-Я, убийца? - спросил я, и почувствовал слабость в ногах, упал на пол. Были чувства, будто меня пронзили стрелой. Я начал терять сознание, и последнее что я услышал…</p>
                    <p>-Мы обязательно встретимся, но я буду не одна…</p>
                    <center><b>* * *</b></center>
                    <p>-Берегись! - кринкул Восьмой, и когтями разрубил стрелу.</p>
                    <p>-Вот же ты, - прошипела Шимрель, и опустила лук.</p>
                    <p>Я только пришёл в себя  после таких воспоминаний. И тут пазл сложился. Эта кошка оживила мою сестру, и натравила против меня… Но как она оживила её, и связано ли то яркое свечение сапфиров с этим?</p>
                    <p>-Спасибо, Восьмой, - сказал я, и прошёл вперёд. -Шимрель, зачем ты натравила на меня мою же сестру?</p>
                    <p>-Зачем? - спросила она, явно с недобрыми намерениями. -Спрашиваешь! Сначала убил моего хозяина, а после и свою сестру.</p>
                    <p>-Твоего хозяина? - переспросил я. -Да я даже его и близко не знаю!</p>
                    <p>-Не ври мне! - сказала кошка, и выстрелила в меня несколько стрел.</p>
                    <p>Я быстро достал меч, и разрубил их.</p>
                    <p>-Видит бог, я хотел без этого, - сказал я, и поднял меч вверх. -Команда, приготовится.</p>
                    <p>Все собрались вокруг меня: Широ, Восьмой, 992к, Решительный и Статист. Я осмотрел их, и опустил меч.</p>
                    <p>-Будьте готовы к атаке, - сказал я, и спрятал меч. -Мы узнаем, что они скрывают…</p><hr>
					<a href="2" class="link">← Предыдущая глава</a> / / <a href="#ups" class="link" id="ups">Следующая глава →</a><br>
					<a href="../univers" class="link">Вернуться к списку рассказов.</a>
				</div>
			</div>
		</div>
	</div>
	<?php include '../template/footer.html'; ?>
</body>
</html>