<!DOCTYPE html>
<html>
<head>
	<title>Хвост 1</title>
	<link rel = "icon" href = "../img/fox_problem.png">
	<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
	<link rel = "stylesheet" href = "../style/style_lit.css">
	<link rel="preconnect" href="https://fonts.googleapis.com">
	<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
	<link href="https://fonts.googleapis.com/css2?family=Montserrat+Alternates:wght@200;300&amp;display=swap" rel="stylesheet">
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<style>
	</style>
</head>
<body>
	<div class="content-main">
		<div class="container">
			<div class="row">
				<div class="col-12">
					<div class="header">
						<h3 style="text-align: center; color: purple; font-family: serif;">Хвост 1: "Поход в стоматологию"</h3>
					</div>
					<p>Автор: DarkusFoxis.<br>Герои: Восьмой, Широ.<br>Возрастное ограничение: 6+.</p><hr color="#00FFFF">
					<p>Несмотря на то, что мы китцунэ, мы так же, как и обычные люди, болеем, и зубы не исключение. Но так как мы стараемся следить за ними, это происходит очень редко. И вот однажды, Восьмой захотел попробовать сходить к стоматологу, и проверить зубы, вдруг что не так с ними, а он не знает.</p>
					<p>-Слушай, может не стоит? - спросила я, когда мы шли в бесплатную больницу. Мне приходилось слышать о них, и не раз говорила Восьмому, что это плохая идея и лучше сходить в платную…</p>
					<p>-Широ, то что говорят в интернете не всегда правда, и не думаю, что нам именно так не повезёт, - сказал он, и улыбнулся.</p>
					<p>Я знаю о том, что в интернете могут врать, но не думаю, что большое количество таких отзывов это просто ложь, однако Восьмой всё равно решил попробовать. Может ему было виднее… Не знаю.</p>
					<p>И вот, мы пришли. При входе мы надели бахилы и прошли дальше. На входе люди смотрели на нас странно, а дети тыкали пальцем, и просили потрогать наши хвосты. Дети больше верят в волшебство, чем взрослые, поэтому наш вид не смущал их. Это было забавно наблюдать.</p>
					<p>Нас остановили у стойки регистрации.</p>
					<p>-Молодые люди, что за маскарад вы устроили? - спросила женщина за стойкой противным голосом. -Снимите это, и приходите обратно. Мы не будем так работать.</p>
					<p>Мы встали. Я ожидала подобного, но чтобы так, да ещё и с порога… Честно говоря, я понимала что мы для обычных людей выглядим как косплееры, но я надеялась, что это не помешает нам в больнице.</p>
					<p>-И…извините, но мы не можем это снять, - начал говорить Восьмой в попытках исправить ситуацию. -Я конечно понимаю, что для вас это просто костюм, но поймите н…</p>
					<p>-Ничего я понимать не собираюсь, - грубо продолжила она. -Либо переодевайтесь, либо уходите отсюда. Мы вас в таком виде не собираемся лечить.</p>
					<p>Тут я немного жалею, что Лис Бездны может убирать уши и хвосты, а мы нет. Ну может оно и к лучшему, хотя часто этот навык очень нужен…</p>
					<p>-Может вы позволите мне хотя бы договорить? - продолжил Восьмой, но я понимала, что это бесполезно.</p>
					<p>-А что мне вас слушать? - она не унималась. -Напридумывают чёрт пойми что, и разгуливают в чём хотят.</p>
					<p>-Мы не можем это снять! - я просто не удержалась, и начала ругаться. -Это часть нас!</p>
					<p>-Девушка, не орите! Если это ваше тело, то вам не к нам, а в ветклинику.</p>
					<p>Мы были в негодовании. Не Восьмой, не я не знали что делать. С одной стороны она права, раз мы лисы, то отчасти звери. Но всё таки в нас больше частей человека! И мне в голову пришла идея.</p>
					<p>-Позовите главного врача.</p>
					<p>-Никого я звать не буду, идите переодеваться, и возвращайтесь.</p>
					<p>-Позовите главного врача, я буду разговаривать только с ним, если вы не хотите нас записывать.</p>
					<p>Если мне говорить диалог между мной и этой тёткой в краце, то мы как кошка с собакой. Правда кто кошка, а кто собака я не знаю, но Восьмой сам позвонил главному врачу. Интересно где он номер взял, хотя на входе висела информация, возможно оттуда. Но по итогу главный врач пришёл, и сам потребовал нас записать. Спасибо ей, если бы не она, то боюсь мы бы ушли домой, так и не осмотрев зубы.</p>
					<p>Когда нас записывали, мне и Восьмому пришлось столько бумаг заполнять, нет я понимаю, нужно, но не так много. Да и к тому же у вас есть всё в компьютере, зачем нам писать ещё? Ну ладно, мы все заполнили, и прошли к кабинету. Перед нами была очередь, но не так чтобы большая, и не то чтобы маленькая… средняя. Я конечно надеялась что её вообще не будет, но зря. Хотя вроде не выходной, и время не вечернее… А вообще, мы поспрашивали людей, и оказалось кто в какой кабинет. В общем, через минут 10-15 мы уже зашли в кабинет.</p>
					<p>Как только мы вошли, я поначалу удивилась: всё было чистенько, много техники современной… У меня в голове на мгновение проскочила мысль, что всё то, что мне показывал интернет, было неправдой. Восьмой подошёл к врачу, и спросил:</p>
					<p>-Извините пожалуйста, а где мне сесть? - от такого вопроса даже я удивилась, но внимательно посмотрев на стоматологическое кресло, мне всё стало понятно.</p>
					<p>Видите ли, для вас, людей, это кресло может быть и удобнее, потому что у вас нет хвостов, а вот нам, божественным лисам и лисицам, это немножко не совсем удобно. Почему? Да потому что это кресло сделано под гладкую спину, и место, где у людей копчик, плотно прилегает, и вот тут и возникла проблема. Хвосты то никуда не убрать, он там прикреплён, и если попытаться сесть в кресло, то скорее всего будет очень больно и неудобно.</p>
					<p>Конечно же врач сам был в шоке, и не понимал что делать. С одной стороны, это не его проблема, а с другой, тогда невозможно будет выполнить свою работу, ведь Восьмой будет вертеться из-за боли. Мы не понимали, как это можно исправить, но по итогу решили доложить подушки, чтобы увеличить длину между креслом и основанием хвостов, и тогда их можно будет положить сбоку. Я быстро принесла подушки, и Восьмой вроде спокойно сел. Конечно, было не очень приятно, ведь подушки прогибались. Врач начал осматривать зубы, и началось…</p>
					<p>-Знаете, ребят, - начал врач, -я конечно понимаю, вы возможно любите аниме, но как вы изменили некоторые зубы? Это же дорого, да и я не видела, чтобы в вашем возрасте так кто либо делал.</p>
					<p>-Так мы и не простые люди, - сказала я. -Иначе мы сняли бы эти вещи, и тогда бы мы не ругались у стойки регистрации.</p>
					<p>-И то верно, - сказал врач, и продолжил осматривать зубы. -Ну, так зубы почти все хорошие, которые я по крайней мере знаю.</p>
					<p>-Отлично, -  мой хвостик радостно завилял. Это была отличная новость.</p>
					<p>-На счёт других зубов я ничего сказать не могу, - врач убрал инструменты, и Восьмой начал потихоньку вставать. -Слушайте, а можно погладить ваши хвосты?</p>
					<p>-Чегось? - я немного была в шоке от этой просьбы. Обычно, мой хвост гладил только Восьмой, но тут даже не знаю…</p>
					<p>-Если хотите, можете мой, - ответил Восьмой, и улыбнулся. Он обычно в этом мало кому отказывает.</p>
					<p>-Большое спасибо, - ответил врач, и прикоснулся к одному из хвостов Восьмого. Я увидела у неё на лице явное удивление. Она до сих пор думала, что эти хвосты не настоящие?</p>
					<p>-Вау, это неожиданно… - врач прекратил гладить. -Хорошо, удачи вам.</p>
					<p>-Спасибо, до свидания! - сказали мы, и вышли из кабинета.</p>
					<p>Мы вскоре вышли на улицу. Посмотрев на время, оказалось что прошёл час, а не 3, как нам казалось. Впрочем, это не имело значения, главное что всё хорошо. Мы выяснили, что с зубами всё хорошо, и спокойно направились домой…</p>
					<center><p><b>Конец записи...</b></p></center>
					<hr color="#00FFFF">
					<p><a href="../other" class="link">Вернуться к списку рассказов.</a></p>
				</div>
			</div>
		</div>
	</div>
	<?php include '../template/footer.html'; ?>
</body>
</html>