// jshint maxerr:1000
//Игровые объекты.
const game = {
  gameOverDescription: 'При входе в комнату, вы почувствовали, что теряете сознание. Это была последняя комната, которую вы смогли лицезреть...',
  gameOutput: false,
  gameExplosion: true,
  gameFirstWater: false,
  gameSecondWater: false,
  gameCristalCave: false,
  gameEssential: 0,
};

//Объекты игрока.
const player = {
  health: 100,
  coins: 0,
  crystals: 0,
  experience: 0,
  total: 0
};

//Объекты эффектов.
const effect = {
  fire: {time: 0, damage: 0, icon: '&#128293;'},
  poison: {time: 0, damage: 0, icon: '&#129514;'},
  paranoia: {time: 0, icon: '&#129535;'},
  bleeding: {time: 0, damage: 0, icon: '&#129656;'},
  darknes: {time: 0, damage: 0, icon: '🌀'},
  regen: {time: 0, heal: 0, icon: '&#128156;'}
};

//Аудио.
const audio = new Audio();


//Массив с предопределенными комнатами.
const rooms = [
  { name: 'Тёмный коридор', description: 'Вы находитесь в узком, темном коридоре. Впереди виден слабый свет.'},
  { name: 'Ловушка', description: 'В тёмном коридоре вы натыкаетесь на небольшую мину. Она взрывается, и немного ранит вас... Но только ли это?...', damage: 5},
  { name: 'Кристальные пещеры', description: 'Вы находите проход в кристальные пещеры, но, кажется, он завален... Стоит обойти.'},
  { name: 'Скалистые пещеры', description: 'Вы дошли до скалистых пещер, о которых читали в учебниках и других книгах. Если вам не изменяет память, то лучше их не трогать, что вы и делаете.'},
  { name: 'Заброшенная комната с сокровищами', description: 'Перед вами комната с сокровищами! Правда, кажется до вас тут кто-то побывал... Осматривая внимательней. вы увидели странную бутылку. Кажется, в ней что-то есть.'},
  { name: 'Комната с сокровищами', description: 'Вы попали в просторную комнату, в которой находились остатки от старых путешественников...', rewards: { coins: 10, experience: 1 } },
  { name: 'Логово монстров', description: 'Вы оказались в мрачном, сыром помещении. Из темных углов доносятся странные звуки и скрежет когтей... Вы замечаете на себе кровоточащие раны...', damage: 25 },
  { name: 'Резкий спуск', description: 'Кажется, под вами оказалась сломанная лестница, на которую вы нечаянно наступили, и с грохотом покатились с неё...', damage: 7 },
  { name: 'Родник', description: 'Вы видите впереди небольшой родник с чистейшей водой. Кажется, для вас это необходимая вещь. Вы немного попили воды, и восстановили силы.', heal: 10},
  { name: 'Эфирные реки', description: 'Вы прошли в очень свободное помещение. Перед вами две реки. Вы чувствуете жажду, и, кажется, стоит попить из реки. Но из какой?...'},
  { name: 'Эфирный родник', description: 'Вы видите впереди небольшой родник, но от него исходят корни. Кажется, он является ключом сакуры бездны. Вы напились её сока, и восстановились гораздо сильнее.', heal: 25},
  { name: "Перевал", description: "Вы пришли к костру. Кажется, здесь очень безопасно.", heal: 5},
  { name: "Кто-то преграждает путь", description: 'Вы приближаетесь к неизвестной комнате, но по пути вы утыкаетесь в кого-то, кто преграждает путь... "Следующий шаг - в могилу, если не присмотришься к дороге!" вскрикнула она. Вы извиняетесь, и говорите, что вам нужно пройти дальше, но кажется незнакомка не торопится уступать. "Проход не бесплатный, понял? Хочешь пройти - плати десять монет, и не жалуйся!" ответила она. Её взгляд направлен на тебя, ожидая твоих действий...'},
  { name: "Логово Даркуса", description: "Пробираясь глубже вы нашли загадочную дверь. За ней скрывался демон Даркус. Он вас не видит, и, кажется, охраняет какую-то дверь. Что вы сделаете?"},
  { name: "Обрыв", description: "Перед вами пропасть. Внизу вы наблюдаете острые, как ножи, камни, и если на них упасть, смерть гарантирована. У вас есть 2 пути: пройти по подвесному мосту, или пройти по краю обрыва. Какой путь вы выберите? В конце моста виднеется мешок. Возможно, он не пустой."},
  { name: "Заброшенная шахта", description: 'Пробираясь в глубь, вы упали с небольшой высоты в заброшенную шахту. Кажется, тут есть чем повеселиться!',  damage: 3},
  { name: "Странная табличка", description: 'Пробираясь в глубь, вы заметили странно пустую комнату. Зайдя в неё, вы видите странный текст на ней: '},
  { name: "Поля Сакуры", description: "Вы наткнулись на огромные плантации сакур. Кажется, эта место принадлежит или DarkOleFoxу, или же какому-то владельцу магазина. Так или иначе, для меня это не сильно интересная вещь..."},
  { name: "Корни сакуры", description: "Спускаясь ниже, вы натыкаетесь на корневую систему сакуры. На некоторых отдельных фрагментах корней виднелись небольшие раны, из которых тёк густой эфир. Вы наклонились, и испробовали этот сок...", heal: 15},
  { name: "Комната летучих мышей", description: "Вы натыкаетесь на непонятную дверь. Открыв её, на вас вылетел рой летучих мышей, который знатно напугал. Осветив комнату, вы ничего не находите интересного..."},
  { name: "Брошенная монетка", description: "Спускаясь глубже, вы наткнулись на монетку. Мелочь, а рано или поздно обязательно пригодится!", rewards: { coins: 1} },
  { name: "Лягушка!!!", description: "Перед вами расстилается небольшой водоём. Вы подходите ближе, но вдруг... На вас выпригивает ЛЯГУШКА!!! И... Всё? Да, после она просто упрыгивает. Вы немного попили из водоёма, и продолжаете свой путь. Может, лягушка была прекрасной принцессой?...", heal: 15},
];
$('#total').text(rooms.length);

//Массив, с надписями на табличках.
const titles = [
  '"Что ты тут ищешь, путник?"',
  '"А ты знал, что ты в этом подъземелье никогда не был один?"',
  '"Почему ты не развернёшься домой? Тут не безопасно.~"',
  '"Я знаю, что ты чувствуешь страх.~"',
  '"Это не реально. Всё, что ты видишь: у тебя в голове.~"',
  '"Мне всегда было интересно: почему вы такие упрямые?~"',
  '"До тебя тут было много путников. Жаль, никто из них не смог пережить этот вечный лабиринт страданий и страха.~"',
  '"А ты знал, что тут есть существа и из других миров?"',
  '"Не верь тьме.~"',
  '"Рано или поздно мы встремится. Я тебе обещаю это."',
  '"Я боюсь темноты..."',
  '"Я ненавижу одиночество..."',
  '"Неужели ты думаешь, что тут что-то важное? Правильное суждение."',
  '"Ты думаешь, что ты умнее здешних сущевств? Не льсти себе, отсюда мало кто выбирался живым. Никто."',
];

function gameOver() {
  $('#room-description').text(game.gameOverDescription);

  $('.game-buttons button').hide();

  $('#restart').show();
}

//Даркус.
function handleDarkusRoom(action) {
  const randomNumber = Math.round(Math.random() * 100);

  if (action === 'kick') {
    if (randomNumber < 95) {
      game.gameOverDescription = 'Вы пнули демона, и ему это явно не понравилось. Вас внезапно пронзила сотня ножей. Последнее, что вы увидели: маниакальную улыбку демона, и как по вашим глазам течёт ваша кровь.';
      player.health -= 9999999;
      updateUI();
      $('#kick, #sneak').hide();
    } else {
      $('#room-description').text('Вы пнули демона, и успели спрятаться. Он вас не заметил, и побежал дальше. Вы прошли в комнату, которую он охранял, и нашли немного монет, кристаллов, и бутылочек опыта. Вот это улов!');
      player.coins += 15;
      player.crystals += 3;
      player.experience += 10;
      $('#go-deeper, #exit').show();
      $('#kick, #sneak').hide();
      updateUI();
    }
  } else if (action === 'sneak') {
    if (randomNumber < 45) {
      $('#room-description').text('Вы тихо и незаметно обошли Даркуса. Вам повезло.');
      $('#go-deeper, #exit').show();
      $('#kick, #sneak').hide();
    } else if (randomNumber < 55) {
      $('#room-description').text('Даркус заметил вас, но ушел с миром. Видимо, он в хорошем настроении, наверное.');
      $('#go-deeper, #exit').show();
      $('#kick, #sneak').hide();
    } else if (randomNumber < 70) {
      $('#room-description').text('Даркус заметил вас и подарил 5 монет. Мелочь, а приятно.');
      player.coins += 5;
      $('#go-deeper, #exit').show();
      $('#kick, #sneak').hide();
      updateUI();
    } else if (randomNumber < 75) {
      $('#room-description').text('Даркус заметил вас и дал вам 1 кристалл. Как неожиданно, и приятно.');
      player.crystals += 1;
      $('#go-deeper, #exit').show();
      $('#kick, #sneak').hide();
      updateUI();
    } else if (randomNumber < 85) {
      $('#room-description').text('Даркус заметил вас, но он был рад вашему появлению. Вы получили 10 бутылочек опыта.');
      player.experience += 10;
      $('#go-deeper, #exit').show();
      $('#kick, #sneak').hide();
      updateUI();
    } else {
      $('#room-description').text('Даркус заметил вас и решил в вас немного пометать ножи. Вы поймали в спину несколько ножей.');
      player.health -= 25;
      effect.bleeding.time += 5;
      effect.bleeding.damage = 10;
      updateUI();
      $('#go-deeper, #exit').show();
      $('#kick, #sneak').hide();
    }
  }
}

//Обрыв.
function handleCliffRoom(action){
  const randomNumber = Math.round(Math.random() * 100);

  if (action === "suspension") {
    if (randomNumber < 65) {
      game.gameOverDescription = 'Вы решили пройти по подвесному мосту, однако дойдя до середины он порвался, и вы стремительно полетели вниз, и разбились об камни...';
      player.health -= 9999999;
      updateUI();
      $('#suspension, #edge').hide();
    } else {
      let randomGem = Math.ceil(Math.random() * 5);
      $('#room-description').text(`Вы успешно прошли по мосту, и открыли сумку. В ней находилось ${randomGem} кристаллов.`);
      player.crystals += randomGem;
      $('#go-deeper, #exit').show();
      $('#suspension, #edge').hide();
      updateUI();
    }
  } else {
    if (randomNumber < 95) {
      $('#room-description').text(`Вы успешно обошли обрыв. наверное, мешок не стоит жизни.`);
      $('#go-deeper, #exit').show();
      $('#suspension, #edge').hide();
      updateUI();
    } else {
      game.gameOverDescription = 'Вы обходите обрыв, однако часть выступа обрушивается под вами, и вы стремительно летите на камни...';
      player.health -= 9999999;
      updateUI();
      $('#suspension, #edge').hide();
    }
  }
}

//Шахта.
function handleMineRoom(action){
  const randomNumber = Math.round(Math.random() * 100);

  switch (action) {
    case "trolley":
      if (game.gameExplosion === false) {
        $('#room-description').text(`Вы решили положить ящики со взрывчаткой в вагонетку, и пустили её. На секунду вы услышали взрыв, и внезапно шахта затряслась... Может, это значит что-то хорошее?`);
        game.gameCristalCave = true;
        $('#trolley').hide();
      } else if (randomNumber < 50) {
        $('#room-description').text(`Вы толкнули вагонетку, и она просто уехала... Ничего интересного.`);
        $('#trolley').hide();
      } else {
        $('#room-description').text(`Вы собирались толкнуть вагонетку. Подойдя ближе, на ваши глаза попала записка: "友達、私たちはこの鉱山で迷子になってはいけません。。。 ここにいることに気付いた場合は、できるだけ早く走ってください。。。 ここから出る方法はない。。。". Жаль, вы не понимаете этот язык, поэтому эта записка была бесполезна. Вы пустили вагонетку, и она уехала в обрыв.`);
        $('#trolley').hide();
      }
      break;
    case "boxes":
      if (randomNumber < 50) {
        $('#room-description').text(`Вы подошли к коробкам, и заметили в них большую кучу взрывчатки... Вы успешно и аккуратно убрали её. Возможно, это спасло вам жизнь...`);
        $('#boxes').hide();
        game.gameExplosion = false;
      } else if (randomNumber < 95) {
        game.gameOverDescription = 'Вы подошли к коробкам, и заметили в них большую кучу взрывчатки... В вашей голове проскочила идея убрать её подальше, но как только коробка оказалась у вас в руках, она тут же взорвалась, не оставив от вас и пустого места...';
        player.health -= 9999999;
        updateUI();
      } else {
        $('#room-description').text(`Вы подошли к коробкам, и заметили в них большую кучу бутыльков опыта! Вот это сюрприз!`);
        $('#boxes').hide();
         player.experience += 25;
         updateUI();
      }
      break;
    case "button":
      if (randomNumber < 75) {
        if (game.gameExplosion) {
          game.gameOverDescription = 'Подойдя к странной кнопке, вы без задней мысли нажали на неё, и услышали странное шипение... Вы только успели поднять глаза на кучу ящиков, как тут же весь тратил в них подорвался, и вас раснесло на мелкие частицы...';
          player.health -= 9999999;
          updateUI();
        } else {
          $('#room-description').text(`Подойдя к странной кнопке, вы без задней мыли нажали на неё, и ничего не произошло. Кажется, те ящики с тротилом были подключены к этой кнопке.`);
          $('#button').hide();
        }
      } else {
        $('#room-description').text(`Подойдя к странной кнопке, вы без задней мыли нажали на неё, и ничего не произошло. Кажется, она сломанна.`);
        $('#button').hide();
      }
      break;
    case "scream":
      if (randomNumber < 25){
        $('#room-description').text(`Вы крикнули на всю шахту, но, кажется вы тут одни. Или может никто с вами не хочет встречаться?`);
        $('#scream').hide();
      } else if (randomNumber < 50) {
        $('#room-description').text(`Вы крикнули на всю шахту, и единственные, кто вас услышал, это летучие мыши...`);
        $('#scream').hide();
      } else if (randomNumber < 75) {
        $('#room-description').text(`Вы крикнули на всю шахту, и на шахте случился обвал!!! Вы немного поранились... Думаю, это был хороший урок, что кричать на шахте точно не стоит...`);
        $('#scream').hide();
        player.health -= 10;
        effect.bleeding.time += 5;
        effect.bleeding.damage = 3;
        updateUI();
      } else {
        game.gameOverDescription = 'Вы крикнули на всю шахту, и вас услышала... Орда монстров... Это не то, кого вы тут ожидали увидеть... К сожалению, они разорвали вас на мелкие частицы...';
        player.health -= 9999999;
        updateUI();
      }
  }
}

//Поднятие бутылки.
function handleBotleUp() {
  const randomNumber = Math.round(Math.random() * 125);

  if (randomNumber < 25) {
    $('#room-description').text(`Вы подняли бутылку, но в ней было пусто... Очередной мусор.`);
    $('#bootle_up').hide();
  } else if (randomNumber < 50) {
    $('#room-description').text(`Вы подняли бутылку, и увидели. что она горит... Она лопнула у вас в руках, и горящее содержимое осталось на вас... `);
    $('#bootle_up').hide();
    effect.fire.time += 3;
    effect.fire.damage = 15;
    updateUI();
  } else if (randomNumber < 75) {
    $('#room-description').text(`Вы подняли бутылку, и, кажется, в ней вода! Вы решаете её попробовать, но... Это оказался алкоголь, который вы тут же выплюнули. Улов совсем не густой...`);
    $('#bootle_up').hide();
    effect.paranoia.time += 5;
    updateUI();
  } else if (randomNumber < 100) {
    $('#room-description').text(`Вы подняли бутылку, и внимательно посмотрели. В ней была вода! Вы её выпили, и направились к выходу, но поняли, что с водой было что-то не так...`);
    $('#bootle_up').hide();
    effect.poison.time += 10;
    effect.poison.damage = 3;
    updateUI();
  } else {
    $('#room-description').text(`Вы подняли бутылку, и внимательно посмотрели. В ней была вода! Вы её выпили, и это оказался эфирная вода!`);
    $('#bootle_up').hide();
    if (effect.bleeding.time === 0) {
      player.health += 25;
    }
    updateUI();
  }
}

//Эфирные реки.
function handleWaterRoom(action) {
  if (action == "firstWater") {
    if (game.gameFirstWater) {
      $('#room-description').text(`Вы решили попить из первой реки. Вода, кажется, чиста. Вы ощущаете прилив сил!`);
      if (effect.bleeding.time === 0) {
        player.health += 15;
      }
      $('#go-deeper, #exit').show();
      $('#firstWater, #secondWater').hide();
      updateUI();
    } else {
      $('#room-description').text(`Вы решили попить из первой реки. Вода, кажется, чиста. Напившись вдоволь, вы решаете продолжить путь, но, кажется, вода была отравлена...`);
      effect.poison.time += 10;
      effect.poison.damage = 5;
      $('#go-deeper, #exit').show();
      $('#firstWater, #secondWater').hide();
      updateUI();
    }
  } else {
    if (game.gameSecondWater) {
      $('#room-description').text(`Вы решили попить из второй реки. Вода, кажется, чиста. Вы ощущаете прилив сил!`);
      if (effect.bleeding.time === 0) {
        player.health += 15;
      }
      $('#go-deeper, #exit').show();
      $('#firstWater, #secondWater').hide();
      updateUI();
    } else {
      $('#room-description').text(`Вы решили попить из второй реки. Вода, кажется, чиста. Напившись вдоволь, вы решаете продолжить путь, но, кажется, вода была отравлена...`);
      effect.poison.time += 10;
      effect.poison.damage = 5;
      $('#go-deeper, #exit').show();
      $('#firstWater, #secondWater').hide();
      updateUI();
    }
  }
}

//Кто-то преграждает путь.
function handleWRoom(action){
  if (action == "pay" && player.coins !== 0) {
    if (player.coins >= 10) {
      $('#room-description').text(`Вы протянули монеты незнакомке. Она с радостью их взяла, и исчезла. Пройдя в комнату, вы нашли старый заброшенный лагерь старых путников. Ещё горел костёр, и, кажется, тут безопасно.`);
      if (effect.bleeding.time === 0) {
        player.health += 15;
      }
      player.coins -= 10;
      player.experience += 3;
      game.gameOutput = true;
      $('#go-deeper, #exit').show();
      $('#pay, #dont_pay').hide();
      updateUI();
    } else {
      $('#room-description').text(`Вы протянули все монеты, что были незнакомке. Она посмотрела на вас с некоторым недовольством, но пропустила. Прикоснувшись к двери, вы почувствовали странное чувство горения... Пройдя в комнату, вы нашли старый заброшенный лагерь старых путников. Ещё горел костёр, и, кажется, тут безопасно... Наверное...`);
      effect.fire.time += 3;
      effect.fire.damage = 10;
      player.coins = 0;
      effect.paranoia.time += 20;
      $('#go-deeper, #exit').show();
      $('#pay, #dont_pay').hide();
      updateUI();
    }
  } else {
    $('#room-description').text(`Вы отказались платить, что её привело в ярость, но она пропала. Прикоснувшись к двери, вы почувствовали тьму... Пройдя в комнату, вы нашли старый заброшенный лагерь старых путников. Ещё горел костёр, но... Вам кажется, что это место не безопасно...`);
    effect.darknes.time += 2;
    effect.darknes.damage = 25;
    effect.paranoia.time += 20;
    $('#go-deeper, #exit').show();
    $('#pay, #dont_pay').hide();
    updateUI();
  }
}

//Кристальная пещера без обвала.
function handleCavesRoom(action) {
  const randomNumber = Math.round(Math.random() * 100);

  switch (action) {
    case "study":
      if (randomNumber < 25) {
        $('#room-description').text(`Вы начитаете изучать пещеру. Она наполнена самыми разными драгоценными камнями. Помимо этого, вы замечаете застывший кусочек эфира сакуры. Вы положили себе в кармашек такую драгоценную вещичку.`);
        game.gameEssential += 1;
        $('#study').hide();
        updateUI();
      } else {
        $('#room-description').text(`Вы начитаете изучать пещеру. Она наполнена самыми разными драгоценными камнями. Вы хотели бы остаться здесь надолго, но к сожалению, это невозможно.`);
        $('#study').hide();
      }
      break;
    case "shoot_down":
      if (randomNumber < 50) {
        $('#room-description').text(`Вы решаете ради забавы посбивать кристаллы сверху. Сбив несколько кристаллов, ваши ноги направляются и к ним, внимательно изучая их, но ничего интересного не находите.`);
        $('#shoot_down').hide();
      } else if (randomNumber < 75) {
        $('#room-description').text(`Вы решаете ради забавы посбивать кристаллы сверху. Сбив несколько кристаллов, ваш взор падает на другие кристаллы, которые начали осыпаться, что приводит к кристаллопаду! Вы резко направляетесь к выходу, и успешно сбегаете без ранений!`);
        $('#study, #shoot_down, #scream_cristal, #review').hide();
      } else {
        $('#room-description').text(`Вы решаете ради забавы посбивать кристаллы сверху. Сбив несколько кристаллов, ваш взор падает на другие кристаллы, которые начали осыпаться, что приводит к кристаллопаду! Вы резко направляетесь к выходу, но по пути на вас падают некоторые осколки кристаллов, оставляя небольшие раны...`);
        player.health -= 10;
        effect.bleeding.time += 6;
        effect.bleeding.damage = 10;
        $('#study, #shoot_down, #scream_cristal, #review').hide();
        updateUI();
      }
      break;
    case "scream_cristal":
      $('#room-description').text(`В вашей голове возникают восспоминания, когда вам некоторые путники рассказывали, что если крикнуть в кристальной пещере, то эхо будет намного звонче. Вы решили попробовать, и очень громко крикнули. Эхо действительно было громче, а так же вы слышите приятный слуху звон кристаллов... Это такая прекрасная мелодия.`);
      $('#scream_cristal').hide();
      break;
    case "review":
      if (randomNumber < 50) {
        $('#room-description').text(`Вы начитаете изучать некоторые кристаллы перед вами. Возможно, это не самая хорошая идея, ведь вы ничего интересного не находите, но только теряете время...`);
        $('#review').hide();
      } else if (randomNumber < 90) {
        $('#room-description').text(`Вы начитаете изучать некоторые кристаллы немного дальше от вас. В некоторых вы замечаете небольшие вкрапление драгоценных камней, которые используются как самая дорогая валюта.`);
        player.crystals += 5;
        $('#review').hide();
        updateUI();
      } else {
        $('#room-description').text(`Вы начитаете изучать некоторые кристаллы, которые находятся в далеке от входа в пещеру. В одном из них вы находите застывший кусочек эфира сакуры!`);
        player.crystals += 5;
        $('#review').hide();
        updateUI();
      }
      break;
  }
}

//Функция использования эфира сакуры.
function useEssential(){
  $('#title').text("Эссенция сакуры");
  $('#room-description').text(`Вы достали из кармана 1 кусочек эссенции сакуры, и съели её. Эти ощущения наполнения сил никогда вас ещё так не расслабляла!`);
  effect.bleeding.time = 0;
  effect.fire.time = 0;
  effect.darknes.time = 0;
  effect.regen.time += 10;
  effect.regen.heal = 15;
  game.gameEssential -= 1;
  if (effect.paranoia.time >= 5) {
    effect.paranoia.time -= 5;
  } else {
    effect.paranoia.time = 0;
  }
  updateUI();
}

//Функция для вывода описания комнаты.
function displayRoomDescription(room) {
  $('#title').text(room.name);
  $('#room-description').text(room.description);
}

//Функция для выбора случайной комнаты.
function getRandomRoom() {
  return rooms[Math.floor(Math.random() * rooms.length)];
}

//Функция для обновления интерфейса.
function updateUI() {
  if (player.health < 25) {
    $('#health').text(player.health);
    $('#health').css('color',"red");
  } else {
    $('#health').text(player.health);
    $('#health').css('color',"white");
  }
  $('#coins').text(player.coins);
  $('#crystals').text(player.crystals);
  $('#experience').text(player.experience);
  $('#game_inf').text(player.total);

  $('#eatEssential').hide();
  $('#count_essential').text(game.gameEssential);
  if (game.gameEssential > 0) {
    $('#eatEssential').show();
  }

  $('#effect').text("");
  $('#poison_time').text(effect.poison.time);
  $('#fire_time').text(effect.fire.time);
  $('#regen_time').text(effect.regen.time);
  $('#paranoia_time').text(effect.paranoia.time);
  $('#bleeding_time').text(effect.bleeding.time);
  $('#darknes_time').text(effect.darknes.time);
  if (effect.regen.time > 0) {
    $('#effect').append(effect.regen.icon);
    $('#health').css('color',"#7B68EE");
  }
  if (effect.fire.time > 0) {
    $('#effect').append(effect.fire.icon);
    $('#health').css('color',"#FFA500");
  }
  if (effect.poison.time > 0) {
    $('#effect').append(effect.poison.icon);
    $('#health').css('color',"#00FF00");
  }
  if (effect.paranoia.time > 0) {
    $('#effect').append(effect.paranoia.icon);
  }
  if (effect.bleeding.time > 0) {
    $('#effect').append(effect.bleeding.icon);
    $('#health').css('color',"#B22222");
  }
  if (effect.darknes.time > 0) {
    $('#effect').append(effect.darknes.icon);
    $('#health').css('color',"#6A5ACD");
  }

  if (player.health <= 0) {
    player.coins = 0;
    player.crystals = 0;
    player.experience = 0;

    $('#coins').text(player.coins);
    $('#crystals').text(player.crystals);
    $('#experience').text(player.experience);

    gameOver();
  }
}

//Функция для обработки входа в комнату.
function enterRoom() {
  const room = getRandomRoom();
  displayRoomDescription(room);
  
  player.total += 1;

  $('.game-buttons button').hide();
  game.gameOutput = false;
  game.gameExplosion = true;
  $("#output").text("");

  switch (room.name) {
    case "Логово Даркуса" :
      $('#kick, #sneak').show();
      break;
    case "Перевал":
      $('#go-deeper, #exit').show();
      if (effect.paranoia.time === 0) {
        game.gameOutput = true;
      }
      player.health += room.heal;
      break;
    case "Странная табличка":
      $('#go-deeper, #exit').show();
      $('#room-description').append(titles[Math.floor(Math.random() * titles.length)]);
      break;
    case "Обрыв":
      $('#suspension, #edge').show();
      break;
    case "Кристальные пещеры":
      if (game.gameCristalCave) {
        $('#room-description').text(`Вы находите проход в кристальные пещеры, и он свободен! Вы проходите в пещеру, и любуетесь неописуемой красотой кристаллов... Что вы хотите сделать, в столь прекрасном и загадочном месте?`);
        $('#study, #shoot_down, #scream_cristal, #review, #go-deeper').show();
        game.gameCristalCave = false;
      } else {
        $('#go-deeper, #exit').show();
      }
      break;
    case "Заброшенная шахта":
      player.health -= room.damage;
      $('#trolley, #boxes, #button, #scream, #go-deeper').show();
      break;
    case "Лягушка!!!":
      $('#go-deeper, #exit').show();
      audio.src = '../song/lyag.mp3';
      audio.volume = 0.7;
      audio.play();
      if (effect.bleeding.time === 0) {
        player.health += room.heal;
      }
      break;
    case "Эфирный родник":
      $('#go-deeper, #exit').show();
      player.health += room.heal;
      effect.regen.time += 5;
      effect.regen.heal = 10;
      effect.fire.time = 0;
      effect.poison.time = 0;
      effect.bleeding.time = 0;
      break;
    case "Корни сакуры":
      $('#go-deeper, #exit').show();
      player.health += room.heal;
      effect.fire.time = 0;
      effect.poison.time = 0;
      effect.bleeding.time = 0;
      if (effect.paranoia.time >= 5) {
        effect.paranoia.time -=5;
      }
      break;
    case "Заброшенная комната с сокровищами":
      $('#go-deeper, #exit, #bootle_up').show();
      break;
    case "Эфирные реки":
      $('#firstWater, #secondWater').show();
      waterFinal = Math.round(Math.random() * 10);
      game.gameFirstWater = waterFinal < 5;
      game.gameSecondWater = waterFinal >= 5;
      break;
    case "Ловушка":
      $('#go-deeper, #exit').show();
      player.health -= room.damage;
      let random = Math.round(Math.random() * 5);
       if (random == 1) {
        effect.fire.time += 2;
        effect.fire.damage = 5;
       } else if (random == 2) {
        effect.paranoia.time += 5;
      } else if (random == 3) {
        effect.darknes.time += 2;
        effect.darknes.damage = 35;
      } else if (random == 4) {
        effect.bleeding.time += 6;
        effect.bleeding.damage = 9;
      } else {
        return;
      }
      break;
    case "Кто-то преграждает путь" :
      $('#pay, #dont_pay').show();
      break;
    default:
      $('#go-deeper, #exit').show();
      if (room.rewards !== undefined) {
        player.coins += room.rewards.coins || 0;
        player.crystals += room.rewards.crystals || 0;
        player.experience += room.rewards.experience || 0;
      }
      player.health -= room.damage || 0;
      if (effect.bleeding.time === 0) {
        player.health += room.heal || 0;
      }
      break;
  }
  if (effect.fire.time > 0) {
    player.health -= effect.fire.damage;
    effect.fire.time -=1;
  }
  if (effect.poison.time > 0) {
    player.health -= effect.poison.damage;
    effect.poison.time -=1;
  }
  if (effect.paranoia.time > 0) {
    effect.paranoia.time -=1;
  }
  if (effect.bleeding.time > 0) {
    player.health -= effect.bleeding.damage;
    effect.bleeding.time -=1;
  }
  if (effect.darknes.time > 0) {
    player.health -= effect.darknes.damage;
    effect.darknes.time -=1;
  }
  if (effect.regen.time > 0) {
    player.health += effect.regen.heal;
    if (effect.paranoia.time >= 5) {
      effect.paranoia.time -=5;
    }
    if (effect.fire.time > 0) {
      effect.fire.time -=1;
    }
    if (effect.poison.time > 0) {
      effect.poison.time -=1;
    }
    if (effect.bleeding.time > 0) {
      effect.bleeding.time -=1;
    }
    if (effect.darknes.time > 0) {
      effect.darknes.time -=1;
    }
    effect.regen.time -=1;
  }
  updateUI();
}

//Функция для обработки выхода из комнаты.
function exitRoom() {
  if (game.gameOutput === false) {
    $("#output").text("Мы не можем выйти из подземелья. Нам нужно найти комнату, где мы сможем осуществить необходимый ритуал.");
  } else {
    $("#output").text("Вывод успешен!");
    updateUI();
    window.location.href= '../index';
  }
}

//Обработка кликов по кнопкам интерфейса.
//Даркус.
$('#kick').click(function() {
  handleDarkusRoom('kick');
});
$('#sneak').click(function() {
  handleDarkusRoom('sneak');
});
//Обрыв.
$('#suspension').click(function() {
  handleCliffRoom('suspension');
});
$('#edge').click(function() {
  handleCliffRoom('edge');
});
//Шахта.
$('#trolley').click(function() {
  handleMineRoom('trolley');
});
$('#boxes').click(function() {
  handleMineRoom('boxes');
});
$('#button').click(function() {
  handleMineRoom('button');
});
$('#scream').click(function() {
  handleMineRoom('scream');
});
//Эфирные реки.
$('#firstWater').click(function() {
  handleWaterRoom('firstWater');
});
$('#secondWater').click(function() {
  handleWaterRoom('secondWater');
});
//Поднятие бутылки.
$('#bootle_up').click(handleBotleUp);

//Выбор при встрече.
$('#pay').click(function() {
  handleWRoom('pay');
});
$('#dont_pay').click(function() {
  handleWRoom('dont_pay');
});
//Кристальная пещера.
$('#study').click(function(){
  handleCavesRoom("study");
});
$('#shoot_down').click(function(){
  handleCavesRoom("shoot_down");
});
$('#scream_cristal').click(function(){
  handleCavesRoom("scream_cristal");
});
$('#review').click(function(){
  handleCavesRoom("review");
});
//Интерфейс.
$('#go-deeper').click(enterRoom);
$('#exit').click(exitRoom);
$('#eatEssential').click(useEssential);

$('#restart').click(function() {
  //Перезапуск.
  if (effect.paranoia.time > 0) {
    player.health = 85;
  } else if (effect.regen.time > 0) {
    player.health = 115;
  } else {
    player.health = 100;
  }
  player.coins = 0;
  player.crystals = 0;
  player.experience = 0;
  player.total = 0;
  effect.fire.time = 0;
  effect.fire.damage = 0;
  effect.poison.time = 0;
  effect.poison.damage = 0;
  effect.bleeding.time = 0;
  effect.bleeding.damage = 0;
  effect.darknes.time = 0;
  effect.darknes.damage = 0;
  game.gameOverDescription = 'При входе в комнату, вы почувствовали, что теряете сознание. Это была последняя комната, которую вы смогли лицезреть...';

  game.gameOutput = false;
  game.gameExplosion = true;
  game.gameCristalCave = false;
  game.gameEssential = 0;

  $('#title').text("Подземелье");

  $('#restart').hide();
  $('#go-deeper, #exit').show();

  $('#room-description').text('Вы проходите в темном подземелье. Судя по сказам народа, тут могут быть скрытые сокровища, поэтому не мудрено, что почти каждый второй желает сюда попасть. Вы готовы погрузиться в малоизвестные катакомбы?');

  updateUI();
});

//Мера безопасности.
$(document).keydown(function(e) {
  if ((e.ctrlKey && e.shiftKey && e.which === 73) || e.which === 123) {
    e.preventDefault();
    location.href = '../403';
  }
});

function showContextMenu(x, y) {
  $('#custom-context-menu').css({
    display: 'block',
    left: x + 'px',
    top: y + 'px'
  });
}

function hideContextMenu() {
  $('#custom-context-menu').hide();
}

$(document).on('contextmenu', function(e) {
  e.preventDefault();
  showContextMenu(e.clientX, e.clientY);
});

//Скрыть контекстное меню при клике вне него.
$(document).on('click', function(e) {
  if (!$(e.target).closest('.context-menu').length) {
    hideContextMenu();
  }
});