<!DOCTYPE html>
<html>
<head>
	<title>Вечерний любовный град</title>
	<link rel = "icon" href = "../img/icon_lit.png">
	<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
	<link rel = "stylesheet" href = "../style/style_lit.css">
	<link rel="preconnect" href="https://fonts.googleapis.com">
	<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
	<link href="https://fonts.googleapis.com/css2?family=Montserrat+Alternates:wght@200;300&amp;display=swap" rel="stylesheet">
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
</head>
<body>
	<div class="content-main">
		<div class="container">
			<div class="row">
				<div class="col-12">
					<div class="header">
						<h3 style="text-align: center; color: purple; font-family: serif;">Вечерний любовный град</h3>
					</div>
					<p>Автор: DarkusFoxis.<br>Герои: Восьмой, Широ.<br>Возрастное ограничение: 16+.</p><hr color="#00FFFF">
					<p>"Пожалуйста, сохрани мой статус кво в любви к тебе, ведь… Мы же знаем, что я буду любить тебя вечно…"</p>
					<p>Москва, ночь, небоскрёб, крыша и дождь - формула настоящей романтики. По крайней мере, так посчитал Восьмой, позвав с собой Широ. Они любят друг друга, и ради счастья готовы на всё. Они сидели под зонтиком. Красные глаза Широ блестели на ярком лунном свету, словно рубин. В то же время её шёрстка так завораживающее переливалась бликами, словно алмаз. А Восьмой и так весь сиял от счастья, ведь ему хватает и простой близости с Широ, а тут он рядом с ней, и только он, как и желал. А дождь бил по зонту, чем очень успокаивал наших лис. Они просто сидели и слушали… Но в планах восьмого было далеко не любование этим явлением…</p>
					<p>– Слушай, Широ… – С опаской в голосе позвал Восьмой.</p>
					<p>– Ммм? – Открыв глаза и внимательно посмотрев на Восьмого, ещё не отойдя от дремоты, стала слушать Широ.</p>
					<p>– Скажи, ты правда останешься здесь? – Задрав уши, спросил Восьмой.</p>
					<p>– Не знаю даже… Наверное да. – Ответила Широ, лениво убрав хвост под зонт.</p>
					<p>– Но ты же хотела вернуться. Передумала?</p>
					<p>– Нет, просто думаю… Зачем госпоже Соре видеть меня неухоженной, грустной, да и… – Широ перевела взгляд с Восьмого на луну. – Здесь очень красиво. Вот взять вашу луну. У себя я не часто могу посмотреть на нее, а тут хоть каждый день, круглый год! – Широ вновь взглянула на Восьмого. – А также, здесь у меня есть тот, кто никогда не прочь разделить компанию за ее разглядыванием. – Широ улыбнулась, смотря в глаза Восьмому. – Поэтому я никогда не уйду.</p>
					<p>Восьмой приобнял Широ заулыбавшись.</p>
					<p>– Спасибо, Широ. Ты скрасишь любую погоду, даже самую худшую.</p>
					<p>Широ облокотилась на Восьмого и обвила хвостом. Через несколько секунд она без раздумий поцеловала его, прикрыв ему глаза. Восьмой от неожиданности вскрикнул, но, через мгновение, нежно прижал к себе, наслаждаясь поцелуем. Казалось, что время остановилось для них двоих, и словно они стали единым организмом, питаясь любовью друг друга. Неожиданный порыв ветра вырвал зонт из их рук, но наших лис не разлучит даже вихрь.</p>
					<p>Наконец, после поцелуя, Широ отдалилась от лица.</p>
					<p>– А теперь… – Произнесла Широ, странно улыбнувшись.</p>
					<p>Восьмой только открыл глаза, как Широ сорвалась с крыши.</p>
					<p>– Нет!!! – Восьмой тут же прыгнул вслед за Широ, устремившись вниз.</p>
					<p>Они оба падали с небоскрёба на огромной скорости. Казалось, капли дождя остановились, а небо содрогнулось. Лунный свет ярким лучом освещал Широ и Восьмого, будто показывая, что такое настоящая, преданная любовь. Восьмой резко схватил за руку Широ и притянул к себе, крепко прижав. "Я люблю тебя" — прошептала Широ, прижавшись к Восьмому в ожидании чуда. Но время нещадно приближало парочку к земле. Восьмой в слезах пытался что-то сделать, ухватиться хоть за что-то, но очень скоро всякая надежда исчезла. В осознании неизбежного, он прижался к Широ, погрузившись в ожидание судьбы…</p>
					<p>До земли оставалось три секунды… две… одна…</p><hr color="#00FFFF">
					<a href="../univers" class="link">Вернуться к списку рассказов.</a>
				</div>
			</div>
		</div>
	</div>
	<?php include '../template/footer.html'; ?>
</body>
</html>