<!DOCTYPE html>
<html>
<head>
	<title>Хэллоуинское застолье</title>
	<link rel = "icon" href = "../img/icon_lit.png">
	<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
	<link rel = "stylesheet" href = "../style/style_lit.css">
	<link rel="preconnect" href="https://fonts.googleapis.com">
	<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
	<link href="https://fonts.googleapis.com/css2?family=Montserrat+Alternates:wght@200;300&amp;display=swap" rel="stylesheet">
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
</head>
<body>
	<div class="content-main">
		<div class="container">
			<div class="row">
				<div class="col-12">
					<div class="header">
						<h3 style="text-align: center; color: purple; font-family: serif;">Хэллоуинское застолье</h3>
					</div>
					<p>Автор: DarkusFoxis.<br>Герои: Оригинал, Решительный, 992, EXE, Тёмная смерть, Шестой, Статист, Восьмой, Широ, MagicFier, Ниндзя, Солнечный, Деникай, Даркус, Ари, Рен, Темис, Создатель, <br>Возрастное ограничение: 12+.<br>Примечание: Это довольно-таки старый рассказ, поэтому стиль написания, некоторые факты о героях, их поведение и имена могут отличаться.</p><hr color="#00FFFF">
					<p>“Являются ли наши мечты снами, которые преследуют нас весь день? Боюсь, на этот вопрос мы никогда не получим ответа…”</p>
					<p>– Оригинал! – крикнул Восьмой, зайдя ко мне в комнату.</p>
					<p>– ААА!!! – вскрикнул я, от неожиданности чуть не выронив аметист. - О боже, Восьмой… Тебя стучаться учили??? Я из-за тебя чуть не разбил камень…</p>
					<p>- Извини, я хотел попросить у тебя одолжить Энерго.</p>
					<p>– И всё?... – я посмотрел на дракончика на моем плече. – Ну что, поможешь Восьмому?</p>
					<p>Тот, ничего не сказав, полетел к лису и сел у него на голове. Восьмой, в свою очередь, погладил приятеля.</p>
					<p>– Спасибо, Оригинал. – сказал лис и убежал.</p>
					<p>– Хех, надеюсь, они ничего не разрушат, – сказал я, продолжая украшать коробку в виде тыквы. – Хотя, и я порой тоже просил о помощи в ненужное время… – продолжал рассуждать, кладя в коробку кольцо с аметистом. – Ну, сейчас это уже как прошлые грешки. Теперь, в настоящее время, мне это не нужно. Только если во мне не проснётся ребёнок, и я не начну подглядывать за Ари, – с насмешкой продолжал рассуждать.</p>
					<p>– А причём тут я? Опять что-то надумал? – из-за угла выглянула ведьма Ари и с ехидным огоньком глянула на меня.</p>
					<p>– Ничего, пушистая лисица, – сказал я, быстро пряча коробку. – На время праздника у меня есть дела поважнее, чем розыгрыши тебя.</p>
					<p>– Да-да, я помню, как на первое сентября я не могла выйти из комнаты, потому что кое-какой негодник по всему полу раскидал ручки да карандаши!</p>
					<p>– Ну, бывает, – почти засмеявшись от воспоминаний пролепетал я.</p>
					<p>– Я тебе потом отомщу же!</p>
					<p>– Ага, и опять вместо зубной пасты у меня будет крем от загара?</p>
					<p>– А тут я подумаю, - видно, что с насмешкой, сказала девятихвостка.</p>
					<p>– Так, ты тут не вздумай шутить, а то ведь опять спать будешь, пропустив всё веселье.</p>
					<p>– Тогда я пожалуй побегу. – сказала она, и направилась в сторону центральной каюты, ну, и я решил не стоять в сторонке, и последовал еë примеру.</p>
					<p>Все были в сборе. Каждый нарядился во что горазд: Решительный примерил роль вампира, 992к и MagicFier стали злыми колдунами, Exe и Солнечный в призраков, Тёмная смерть с Изменщиком в летучую мышь, Шестой с Восьмым в оборотней, Статист, о боже мой, превратился в гота, а наш Ниндзя решил остаться у себя в комнате — не любит он хэллоуин и всё тут, не его это. И только Даркус с Деникай решили остаться собой. Хотя, это правильное решение, особенно зная Даркуса и его приколы. Ну, а я вырядился в пугало Джека. Не знаю, почему мне именно его предложила Ари, но кто я такой, чтобы ей перечить? Именно.</p>
					<p>Время было 23:31, 31 октября. Я сел рядом с Создателем и Ари. Создатель внимательно глядел в окно, как будто чего-то ожидая. Я решил поинтересоваться, ведь так было в каждый праздник, и не только, и этот факт меня настораживал.</p>
					<p>– Слушай, Создатель, ты практически каждый наш сбор всё время глядишь в окно…</p>
					<p>– Тебе интересно, почему?</p>
					<p>– Ну да. Меня это настораживает.</p>
					<p>– Что ж… Это связано с одним достаточно неприятным и жутким событием…</p>
					<p>– То, что весь ваш праздничный стол съела одна не очень культурная лиса? – сказал Даркус, и влепил восьмому по лбу ложкой.</p>
					<p>– Ай! За что?! – достаточно агрессивно спросил Восьмой.</p>
					<p>– Не, а что? По фактам же? Кто полез за едой раньше времени?</p>
					<p>– Да? А кто это готовил??? Ты, ротатый недобес?!</p>
					<p>– Я попросил бы шубку с лапами прикрыть свою, хоть и пушистую, но всё же хлеборезку!</p>
					<p>– А я бы попросил – уже я не выдержал – прикрыться вам обоим. В ином случае, у Энерго будет прекрасное барбекю с хвостом и рогами.</p>
					<p>Хвала небесам, эти оба прикрыли свои рты. Я только одно понять не могу, вроде взрослые, а грызутся как кот и пёс. В нашем случае, лис и демон. Хотя, если вспомнить, что восьмой является одним из ангелов, то всё встаёт на свои места...</p>
					<p>– Кхем… Прошу прощения, Создатель, продолжай.</p>
					<p>– Спасибо, Оригинал, – сказал Создатель, отвлечась от окна, – хотя, на твоём месте, я бы дал им доругаться.</p>
					<p>– Извини, мало бы что изменилось бы.</p>
					<p>– И то верно. Кхм… Как я говорил, это связано с одним достаточно неприятным и жутким событием, который и заставил вас появиться… Как-то, в один праздничный день, точно не могу вспомнить в какой, примерно в 1896 году… А, получается тоже хэллоуин, ведь год тому назад его начали отмечать.</p>
					<p>– Я извиняюсь за то что перебиваю, – Солнечный встал с места и стукнул посохом по полу, – но в какой стране ты находился тогда, вместе с Инпериусом, Копьеносом, и Шимрелей?</p>
					<p>– Я и Империус в Шотландии, а Копьенос и Шимрель — в Англии.</p>
					<p>– Ага, вопросов более не имею. – Солнечный вернулся на место. – Продолжай.</p>
					<p>– Хорошо. Так вот, тогда я часто общался с одной интересной мадам. Была она не из бедной, но и не из богатой семьи. Её отец был кузнецом, а мать одной из святых. А я в те времена был известен как “посланник бога”, или даже как “сын бога”. Иногда доходило до абсурда, и некоторые вообще считали меня “Адамом”. Но та считала всё же “посланником бога”. Из-за этого, она просила меня передавать её молитвы богу. Я, конечно, общался с богом, и даже отправлял ему её молитвы, но всё же просил её понять, что я не его посланник. Но вернусь к теме. В тот день я попросился к ней в гости, отпраздновать хэллоуин. Меня приняли, и её отец вручил мне эти клинки, – Создатель достал свои клинки, которые он всегда носил при себе, и далеко никогда не убирал. И тут я понял одну очень важную вещь, а именно то, насколько Создатель был предан ей, раз он до сих пор хранит эти клинки, и они настолько прекрасно сохранились, что даже мой меч дракона не настолько ровный, как его “Вечности”, – как после он сказал, по просьбе её дочери. Как оказалось, она видела, как я тренируюсь в лесу со своими клинками, – и он достал пару клинков, которые тоже были в хорошем состоянии, но имели одно главное различие: рукоятка. У “Вечностей” рукоять была меньшее, как под руку Создателя, и металлическая, а у этих рукоять была толстая и деревянная. – и попросила изготовить для меня новые клинки. На вопрос “За какие такие заслуги?”, последовал короткий и исчерпывающий ответ: “Подарок”...</p>
					<p>– Эх, вот если бы так же отвечал Восьмой… – сказала Широ, мечтательно виля хвостиком.</p>
					<p>– Да что опять я… – Восьмой похоже не понимает намёков Широ, хотя эта парочка вместе уже далеко не первый год.</p>
					<p>– А ты чего ожидал от женщин? Нужно быть быстрым и точным! – ответил Решительный. Сказать, что я не ожидал подобного ответа, значит соврать. Как раз, я ожидал такого ответа от него, ведь от него только такие ответы и идут.</p>
					<p>– Да… Хватит!!! – Восьмой вскочил с места. Видно, что он уже был на пределе.</p>
					<p>– Да я же пошутила! – Широ — это отдельный вид шутниц. Такие сначала говорят что-то обидное, а после оправдываются, что то была шутка.</p>
					<p>– Обидно очень!!! –  Восьмой начал успокаиваться, и сел на место.</p>
					<p>– Успокойся, лисик... – Широ обняла Восьмого. Это парочка, просто нечто. Их лекарство — обнимашки. Болит голова? Обнимашки, и головной боли нет. Обида? Обнимашки, и обида сходит на нет. Перелом всех костей? Обнимашки, и всё, переломов как и не бывало.</p>
					<p>– Что ты малишь мои преимущества?...</p>
					<p>– Даже поиздеваться нельзя.</p>
					<p>– Кхем… – Создатель, видно, немного зол. – Нежиться в постели будете, когда одни останетесь. Не надо здесь щенячьи нежности разводить. Может я продолжу?</p>
					<p>– Извини Широ. Она так часто.</p>
					<p>– Так может будешь её ласкать чаще, раз она лезет с этим в прилюдном месте? Это не подобает воину нашей команды! – твёрдо и чётко сказал 992к. – Создатель, продолжайте.</p>
					<p>– Поддерживаю 992. – хором сказали MagicFier, EXE и Тёмная смерть.</p>
					<p>– Так, на чём меня сбили… Ах, да, подарок. Время приближалось к семи вечера, как мы нарядились в костюмы и отправились за сладостями. Точно не могу сказать, сколько набрали, но для нас было мало. Время уже подходило к одиннадцати ночи. Мы пришли домой, переоделись, и решили не ждать, легли спать. Не помню, много ли проспали, но когда я очнулся, нас на кладбище тащили призраки. Я слегка шокировался таким подарочком, но успел достать оружие. Правда, потом, когда я с большой высоты летел в пропасть, понял что призраки не имеют тела.</p>
					<p>Создатель сделал паузу, а позже продолжил.</p>
					<p>– Я быстро очнулся, и, ориентируясь по эстраде ведьм, я побежал к кладбищу. Но было поздно. Её погребли заживо. В тот момент, я просто перестал контролировать себя, налетел на ведьм. Половине снёс головы, а половине и руки повырывал. В итоге, меня схватил Джек – главный дух Хэллоуина. И сказал: “Если бы вы не проспали моё пришествие — возможно и остались бы в живых. Но вы нарушили ритуал, и должны быть наказаны. Она получила своё, ровно как и ты, поэтому, иди”. И я очнулся, а надо мной стоял Империус. Мы переглянулись, я встал, и мы направились в Англию, к Копьеносу и Шимрель.</p>
					<p>Тут мы услышали стук.</p>
					<p>– Вовремя. Я как раз завершил, – сказал Создатель с облегчением. Его рассказ заставил меня задуматься.</p>
					<p>– Я открою, – Ари встала, и направилась ко входу.</p>
					<p>– Так, а причём здесь то, что ты без конца смотришь в окно? – я задал такой вопрос, пытаясь что-то понять из услышанного.</p>
					<p>– При том, что я слежу за тем, чтобы никого не утащили, – ответил Создатель.</p>
					<p>– Это же ту…</p>
					<p>– К нам Темис и Рен пришли! – перебила меня Ари, вводя в комнату Дракона с лисом.</p>
					<p>– О, пушистый! – Даркус, не изменяя традициям, начал издеваться над Темисом. Тот, в свою очередь, спрятался за драконом.</p>
					<p>– Даркус, может прекратишь издеваться над Темисом? – Рен недовольно глянула на Даркуса.</p>
					<p>–  Главное, за что? – Темис выглянул из-за Рен</p>
					<p>– Ну, знаешь…</p>
					<p>– Ему нечем заняться. Кстати, уже 23:58, так что, присаживайтесь, – Ари, как всегда, спасает положение. За это она мне и нравится.</p>
					<p>Темис и Рен сели там, где им указала Ари, а после и Ари села там, где и сидела.</p>
					<p>– За что же ты меня так ненавидишь? – спросил Даркус у Ари.</p>
					<p>– За то, что ты пытался меня изнасиловать.</p>
					<p>– Когда это бы…</p>
					<p>– Всмыле?!... – тут я уже начал негодовать, но звук часов меня перебил.</p>
					<p>Время 00:00, а значит — наступил хэллоуин. И мы все хором закричали: “ Всех с хэллоуи…”.</p>
					<p>– Кто выключил све…</p>
					<p>– Если то время прошло, то не значит же это, что ты <b>ПОЛНОСТЬЮ ИСКУПИЛ СВОЮ ВИНУ, Я ВЕДЬ ПРАВ?!</b></p><hr color="#00FFFF">
					<a href="../univers" class="link">Вернуться к списку рассказов.</a>
				</div>
			</div>
		</div>
	</div>
    <?php include '../template/footer.html'; ?>
</body>
</html>